Repository: GregValiant/CuraMaster
Catalog: resources/i18n/*/fdmprinter.def.json.po
Languages: pl

# dual_pre_wipe description
source: After switching extruder, wipe the oozed material off of the nozzle on the first thing printed. This performs a safe slow wipe move at a place where the oozed material causes least harm to the surface quality of your print.
pl: Po wyłączeniu wytłaczarki wytrzeć wytłoczony materiał z dyszy na pierwszą drukowaną drukarkę. Zapewnia to bezpieczne, wolne przemieszczanie w miejscu, w którym wypchnięty materiał powoduje najmniej szkodliwy wpływ na jakość wydruku.

# dual_pre_wipe label
source: Wipe Nozzle After Switch
pl: Wytrzeć dyszę po przełączeniu

# expand_lower_skins description
source: Expand the bottom skin areas (areas with air below) so that they are anchored by the infill layers above and below.
pl: Rozwiń dolne obszary ścian (obszary o powietrzu poniżej) tak, aby były zakotwiczone przez warstwy wypełniające powyżej i poniżej.

# expand_lower_skins label
source: Expand Bottom Skins Into Infill
pl: Rozszerzyć ściany poniżej wypełnienia

# expand_skins_expand_distance description
source: The distance the skins are expanded into the infill. The default distance is enough to bridge the gap between the infill lines and will stop holes appearing in the skin where it meets the wall when the infill density is low. A smaller distance will often be sufficient.
pl: Odległość ścian są rozszerzane do wypełnienia. Domyślna odległość wystarczy, aby pokonać szczelinę między liniami wypełnienia i zatrzyma otwory pojawiające się w ścianie, gdzie spotyka się ze ścianą, gdy gęstość nasycenia jest niska. Mniejsza odległość będzie często wystarczająca.

# expand_skins_expand_distance label
source: Skin Expand Distance
pl: Odległość rozszerzenie warstwy wierzchniej

# expand_skins_into_infill description
source: Expand skin areas of top and/or bottom skin of flat surfaces. By default, skins stop under the wall lines that surround infill but this can lead to holes appearing when the infill density is low. This setting extends the skins beyond the wall lines so that the infill on the next layer rests on skin.
pl: Rozszerzyć zewnętrzne obszary skóry na górną i / lub dolną powłoką na płaskich powierzchniach. Domyślnie, powłoka kończy się na linii ściany otaczające wypełnienie, chociaż może to prowadzić do małej gęstości otworu napełniania do edukacji. Ustawienie to rozciąga się poza zewnętrzną skórę po liniach ścian, tak, że nadzienie pozostaje na następnej warstwy na zewnętrznej skóry.

# expand_skins_into_infill label
source: Expand Skins Into Infill
pl: Rozszerzyć ściany wypełniania

# expand_upper_skins description
source: Expand the top skin areas (areas with air above) so that they support infill above.
pl: Rozwiń górne obszary ścian (obszary o powietrzu powyżej) tak, aby wspomagały wypełnienie powyżej.

# expand_upper_skins label
source: Expand Top Skins Into Infill
pl: Rozszerzenia ścian w górnym wypełnieniu

# experimental description
source: experimental!
pl: eksperymentalny!

# experimental label
source: Experimental
pl: Eksperymentalny

# extruder_prime_pos_abs description
source: Make the extruder prime position absolute rather than relative to the last-known location of the head.
pl: Wolisz bezwzględną pozycję głowicy drukującej zamiast względnego położenia do ostatniej znanej pozycji głowy.

# extruder_prime_pos_abs label
source: Absolute Extruder Prime Position
pl: Wytłaczarka pozycja bezwzględna obciążenie

# extruder_prime_pos_x description
source: The X coordinate of the position where the nozzle primes at the start of printing.
pl: Współrzędna X położenia, w którym liczba pierwszych dyszy na początku drukowania.

# extruder_prime_pos_x label
source: Extruder Prime X Position
pl: X wlotu położenie wytłaczarki

# extruder_prime_pos_y description
source: The Y coordinate of the position where the nozzle primes at the start of printing.
pl: Współrzędna Y położenia, w którym liczba pierwszych dyszy na początku drukowania.

# extruder_prime_pos_y label
source: Extruder Prime Y Position
pl: Y-wlotu położenie wytłaczarki

# extruder_prime_pos_z description
source: The Z coordinate of the position where the nozzle primes at the start of printing.
pl: Współrzędna położenia, w którym dysza liczb pierwszych w rozpoczęcia drukowania.

# extruder_prime_pos_z label
source: Extruder Prime Z Position
pl: Z-położenia wlotu wytłaczarki

# fill_perimeter_gaps description
source: Fills the gaps between walls where no walls fit.
pl: Wypełnia szczeliny między ścianami, w których nie ma ścian.

# fill_perimeter_gaps label
source: Fill Gaps Between Walls
pl: Wypełnij szczeliny między ścianami

# fill_perimeter_gaps option everywhere
source: Everywhere
pl: Wszędzie

# fill_perimeter_gaps option nowhere
source: Nowhere
pl: Nigdzie

# gantry_height description
source: The height difference between the tip of the nozzle and the gantry system (X and Y axes).
pl: Różnica wysokości między wierzchołkiem dyszy i układu bramowej (X i Y).

# gantry_height label
source: Gantry height
pl: wysokość mostka

# gradual_infill_step_height description
source: The height of infill of a given density before switching to half the density.
pl: Wysokość wypełnienia o danej gęstości przed przejściem na połowę gęstości.

# gradual_infill_step_height label
source: Gradual Infill Step Height
pl: Stopień stopniowego wypełnienia

# gradual_infill_steps description
source: Number of times to reduce the infill density by half when getting further below top surfaces. Areas which are closer to top surfaces get a higher density, up to the Infill Density.
pl: Liczba razy, aby zmniejszyć gęstość zalewu o połowę, gdy będzie się dalej pod górnymi powierzchniami. Obszary, które są bliżej górnej powierzchni, mają większą gęstość, aż do gęstości wypełnienia.

# gradual_infill_steps label
source: Gradual Infill Steps
pl: Stopniowe kroki wypełnienia

# infill description
source: Infill
pl: Wypełnienie

# infill label
source: Infill
pl: Wypełnienie

# infill_angles description
source: A list of integer line directions to use. Elements from the list are used sequentially as the layers progress and when the end of the list is reached, it starts at the beginning again. The list items are separated by commas and the whole list is contained in square brackets. Default is an empty list which means use the traditional default angles (45 and 135 degrees for the lines and zig zag patterns and 45 degrees for all other patterns).
pl: Lista prostych poleceń do użycia. Elementy z listy są używane kolejno w miarę postępu warstw, a kiedy kończy się lista, zaczyna się od początku. Elementy listy są oddzielone przecinkami, a cała lista znajduje się w nawiasach kwadratowych. Domyślnie jest pusta lista, która oznacza tradycyjne domyślne kąty (45 i 135 stopni dla linii i wzorów zygzakowców i 45 stopni dla wszystkich pozostałych wzorów).

# infill_angles label
source: Infill Line Directions
pl: Kierunek lini wypełnienia

# infill_before_walls description
source: Print the infill before printing the walls. Printing the walls first may lead to more accurate walls, but overhangs print worse. Printing the infill first leads to sturdier walls, but the infill pattern might sometimes show through the surface.
pl: Wydrukuj wypełnienie przed wydrukowaniem ścian. Drukowanie ścian po raz pierwszy może prowadzić do bardziej dokładnych ścian, ale pogorszy wydruki. Drukowanie wypełnienia najpierw prowadzi do mocniejszych ścian, ale wzór wypełnienia może czasem wskazywać na powierzchnię.

# infill_before_walls label
source: Infill Before Walls
pl: Wypełnij przed ścianami

# infill_hollow description
source: Remove all infill and make the inside of the object eligible for support.
pl: Usunąć wszystkie wypełnienia i umieścić wewnątrz obiektu kwalifikującego się do wsparcia.

# infill_hollow label
source: Hollow Out Objects
pl: Wyjmij obiekty

# infill_line_distance description
source: Distance between the printed infill lines. This setting is calculated by the infill density and the infill line width.
pl: Odległość między drukowanymi liniami wypełnienia. To ustawienie jest obliczane przez gęstość wypełnienia i szerokość linii wypełnienia.

# infill_line_distance label
source: Infill Line Distance
pl: Odstęp linii wypełnienia

# infill_line_width description
source: Width of a single infill line.
pl: Szerokość pojedynczej linii wypełniania.

# infill_line_width label
source: Infill Line Width
pl: Szerokość linii wypełniania

# infill_mesh description
source: Use this mesh to modify the infill of other meshes with which it overlaps. Replaces infill regions of other meshes with regions for this mesh. It's suggested to only print one Wall and no Top/Bottom Skin for this mesh.
pl: Użyj tej siatki, aby zmodyfikować wypełnienie innych oczek, z którymi się pokrywają. Zastępuje obszary wypełnienia innych oczek z regionami dla tej siatki. Proponuje się wydrukować tylko jedną ścianę, a nie górną / dolną skórę dla tej siatki.

# infill_mesh label
source: Infill Mesh
pl: Siatki wypełniające

# infill_mesh_order description
source: Determines which infill mesh is inside the infill of another infill mesh. An infill mesh with a higher order will modify the infill of infill meshes with lower order and normal meshes.
pl: Określa, która siatka wypełniająca znajduje się wewnątrz wypełnienia innej siatki wypełniającej. Siatka wypełniająca o wyższym porządku modyfikuje wypełnienie siatki wypełnień o niższym rzędzie i normalnych oczek.

# infill_mesh_order label
source: Infill Mesh Order
pl: Zamówienie wypełnienia siatki

# infill_overlap description
source: The amount of overlap between the infill and the walls. A slight overlap allows the walls to connect firmly to the infill.
pl: Ilość nakładania się między wypełnieniem a ścianami. Nieznaczne nałożenie pozwala ściśle łączyć się z wypełnieniem.

# infill_overlap label
source: Infill Overlap Percentage
pl: Procent wypełnienia

# infill_overlap_mm description
source: The amount of overlap between the infill and the walls. A slight overlap allows the walls to connect firmly to the infill.
pl: Ilość nakładania się między wypełnieniem a ścianami. Nieznaczne nałożenie pozwala ściśle łączyć się z wypełnieniem.

# infill_overlap_mm label
source: Infill Overlap
pl: Zachodzenie wypełnienia

# infill_pattern description
source: The pattern of the infill material of the print. The line and zig zag infill swap direction on alternate layers, reducing material cost. The grid, triangle, cubic, tetrahedral and concentric patterns are fully printed every layer. Cubic and tetrahedral infill change with every layer to provide a more equal distribution of strength over each direction.
pl: Wzór materiału wypełniającego z nadruku. Linia i zygzakowy kierunek wypełnienial na alternatywnych warstwach, zmniejszając koszt materiału. Wzory siatki, trójkąty, sześcianu, czworościanu i koncentrycznych są w pełni drukowane na każdej warstwie. Wymiana wypełnienia sześciennego i czterowartościowego z każdą warstwą zapewnia bardziej równomierny rozkład siły w każdym kierunku.

# infill_pattern label
source: Infill Pattern
pl: Wzór wypełnienia

# infill_pattern option concentric
source: Concentric
pl: Koncentryczny

# infill_pattern option concentric_3d
source: Concentric 3D
pl: Koncentryczny 3D

# infill_pattern option cubic
source: Cubic
pl: Sześcienny

# infill_pattern option cubicsubdiv
source: Cubic Subdivision
pl: Podział sześcienny

# infill_pattern option grid
source: Grid
pl: Krata

# infill_pattern option lines
source: Lines
pl: Liniowy

# infill_pattern option tetrahedral
source: Tetrahedral
pl: Czworościenny

# infill_pattern option triangles
source: Triangles
pl: Trójkąty

# infill_pattern option zigzag
source: Zig Zag
pl: Zygzak

# infill_sparse_density description
source: Adjusts the density of infill of the print.
pl: Dostosowuje gęstość wypełnienia wydruku.

# infill_sparse_density label
source: Infill Density
pl: Gęstość wypełnienia

# infill_sparse_thickness description
source: The thickness per layer of infill material. This value should always be a multiple of the layer height and is otherwise rounded.
pl: Grubość na warstwie materiału wypełniającego. Ta wartość powinna zawsze być wielokrotnością wysokości warstwy i być zaokrąglana w inny sposób.

# infill_sparse_thickness label
source: Infill Layer Thickness
pl: Grubość warstwy wypełnienia

# infill_wipe_dist description
source: Distance of a travel move inserted after every infill line, to make the infill stick to the walls better. This option is similar to infill overlap, but without extrusion and only on one end of the infill line.
pl: Odległość przesuwu włożonego po każdej linii wylotowej, aby lepiej przymocować drążek wyrównawczy do ścian. Ta opcja jest podobna do nakładania się wypełnienia, ale bez wytłaczania i tylko na jednym końcu linii wypełnienia.

# infill_wipe_dist label
source: Infill Wipe Distance
pl: Odstęp wypełnienia

# jerk_enabled description
source: Enables adjusting the jerk of print head when the velocity in the X or Y axis changes. Increasing the jerk can reduce printing time at the cost of print quality.
pl: Umożliwia dostosowanie funkcji szarpnięć głowicy drukującej w przypadku zmiany prędkości w osi X lub Y. Zwiększenie funkcji szarpnięć może skrócić czas drukowania kosztem jakości druku.

# jerk_enabled label
source: Enable Jerk Control
pl: Aktywuj kontrolę szarpnięć

# jerk_infill description
source: The maximum instantaneous velocity change with which infill is printed.
pl: Maksymalna różnica prędkości chwilowej w którym wypełnienie jest drukowane.

# jerk_infill label
source: Infill Jerk
pl: Wypełnienie Funkcja szarpnięcie (jerk)

# jerk_layer_0 description
source: The print maximum instantaneous velocity change for the initial layer.
pl: Maksymalna zmiana chwilowej prędkości dla pierwszej warstwy.

# jerk_layer_0 label
source: Initial Layer Jerk
pl: Funkcja szarpnięcie (jerk) pierwszej warstwie

# jerk_prime_tower description
source: The maximum instantaneous velocity change with which the prime tower is printed.
pl: Maksymalne chwilowe zmiany prędkości posuwu z wieżą jest drukowany.

# jerk_prime_tower label
source: Prime Tower Jerk
pl: Jerk zmiany prędkości posuwu z wieżą

# jerk_print description
source: The maximum instantaneous velocity change of the print head.
pl: Maksymalna chwilowa zmiana prędkości głowicy drukującej.

# jerk_print label
source: Print Jerk
pl: Jerk funkcja druku

# jerk_print_layer_0 description
source: The maximum instantaneous velocity change during the printing of the initial layer.
pl: Maksymalna zmiana chwilowej prędkości podczas druku na pierwszej warstwie

# jerk_print_layer_0 label
source: Initial Layer Print Jerk
pl: Jerk warstwy początkowej druku

# jerk_skirt_brim description
source: The maximum instantaneous velocity change with which the skirt and brim are printed.
pl: Maksymalna zmiana chwilowej prędkości mogą być drukowane z płaszcza i brzegi.

# jerk_skirt_brim label
source: Skirt/Brim Jerk
pl: Jerk Skirt/Brim

# jerk_support description
source: The maximum instantaneous velocity change with which the support structure is printed.
pl: Maksymalna natychmiastowa zmiana prędkości, przy której konstrukcja nośna jest drukowana.

# jerk_support label
source: Support Jerk
pl: Jerk konstrukcja nośna

# jerk_support_bottom description
source: The maximum instantaneous velocity change with which the floors of support are printed.
pl: Maksymalna szybkość zmiany chwilowej, z jaką są drukowane podłoża.

# jerk_support_bottom label
source: Support Floor Jerk
pl: Funkcja szarpnięcie (jerk) struktury podłoża

# jerk_support_infill description
source: The maximum instantaneous velocity change with which the infill of support is printed.
pl: Maksymalna różnica prędkości chwilowej z których wypełnienie konstrukcji nośnej jest drukowane.

# jerk_support_infill label
source: Support Infill Jerk
pl: Funkcja szarpnięcie (jerk) konstrukcja nośna wypełniania

# jerk_support_interface description
source: The maximum instantaneous velocity change with which the roofs and floors of support are printed.
pl: Maksymalna natychmiastowa zmiana prędkości, przy której dachy i stropy konstrukcji nośnej mają zostać wydrukowane.

# jerk_support_interface label
source: Support Interface Jerk
pl: Funkcja szarpnięcie (jerk) interfejs konstrukcja nośna

# jerk_support_roof description
source: The maximum instantaneous velocity change with which the roofs of support are printed.
pl: Maksymalna zmiana chwilowej prędkości z dachów konstrukcji nośnej do wydrukowania.

# jerk_support_roof label
source: Support Roof Jerk
pl: Funkcja szarpnięcie (jerk) do konstrukcji dachu

# jerk_topbottom description
source: The maximum instantaneous velocity change with which top/bottom layers are printed.
pl: Maksymalna różnica prędkości chwilowej w którym górne / dolne warstwy druku.

# jerk_topbottom label
source: Top/Bottom Jerk
pl: Funkcja szarpnięcie (jerk) górnej / dolnej warstwy

# jerk_travel description
source: The maximum instantaneous velocity change with which travel moves are made.
pl: Maksymalna natychmiastowa zmiana prędkości, przy której odbywa się ruch podróży.

# jerk_travel label
source: Travel Jerk
pl: Podróże Jerk

# jerk_travel_layer_0 description
source: The acceleration for travel moves in the initial layer.
pl: Przyspieszenie ruchu napędu pierwszej warstwy.

# jerk_travel_layer_0 label
source: Initial Layer Travel Jerk
pl: Funkcja szarpnięcie przepływu w pierwszej warstwie

# jerk_wall description
source: The maximum instantaneous velocity change with which the walls are printed.
pl: Maksymalna różnica prędkości chwilowej z którego ściany są drukowane.

# jerk_wall label
source: Wall Jerk
pl: Funkcja szarpnięcie (jerk) ścianki

# jerk_wall_0 description
source: The maximum instantaneous velocity change with which the outermost walls are printed.
pl: Maksymalna zmiana chwilowej prędkości z zewnętrznymi ścianami do wydrukowania.

# jerk_wall_0 label
source: Outer Wall Jerk
pl: Funkcja szarpnięcie (jerk) zewnątrz ścianki

# jerk_wall_x description
source: The maximum instantaneous velocity change with which all inner walls are printed.
pl: Maksymalna zmiana chwilowej prędkości, wszystkie wewnętrzne ściany są drukowane.

# jerk_wall_x label
source: Inner Wall Jerk
pl: Funkcja szarpnięcie (jerk) wewnętrznej ściance

# layer_0_z_overlap description
source: Make the first and second layer of the model overlap in the Z direction to compensate for the filament lost in the airgap. All models above the first model layer will be shifted down by this amount.
pl: Pierwsza i druga warstwa modelu są zachodzą na siebie w kierunku Z w celu skompensowania utraconego włókna w szczelinie powietrznej. Przenieś wszystkie modele od pierwszej warstwy modelu o tej wartości w dół.

# layer_0_z_overlap label
source: Initial Layer Z Overlap
pl: Początkowa warstwa Z pokrywają się

# layer_height description
source: The height of each layer in mm. Higher values produce faster prints in lower resolution, lower values produce slower prints in higher resolution.
pl: Grubość każdej warstwy w mm. Przy wyższych wartościach szybsze Urządzenie jest przystosowane do niższej rozdzielczości w niższych wartościach wolniej wydruki o wyższej rozdzielczości.

# layer_height label
source: Layer Height
pl: Grubość warstwy

# layer_height_0 description
source: The height of the initial layer in mm. A thicker initial layer makes adhesion to the build plate easier.
pl: Wysokość początkowej warstwy w mm. Grubsza warstwa powoduje lepszą początkową przyczepność do stołu.

# layer_height_0 label
source: Initial Layer Height
pl: Grubość pierwszej warstwy

# layer_start_x description
source: The X coordinate of the position near where to find the part to start printing each layer.
pl: Współrzędna X położenia, w pobliżu miejsca, gdzie znajduje się część, aby rozpocząć drukowanie każdej warstwy.

# layer_start_x label
source: Layer Start X
pl: Uruchomienie warstwy X

# layer_start_y description
source: The Y coordinate of the position near where to find the part to start printing each layer.
pl: Współrzędna Y położenia, w pobliżu miejsca, gdzie znajduje się część, aby rozpocząć drukowanie każdej warstwy.

# layer_start_y label
source: Layer Start Y
pl: Uruchom warstwę Y

# line_width description
source: Width of a single line. Generally, the width of each line should correspond to the width of the nozzle. However, slightly reducing this value could produce better prints.
pl: Szerokość jednej linii. Ogólnie, szerokość powinna odpowiadać każdej linii szerokości dyszy. Jednak nieznaczne zmniejszenie tej wartości może doprowadzić do lepszego drukowania.

# line_width label
source: Line Width
pl: Szerokość linii

# machine_acceleration description
source: The default acceleration of print head movement.
pl: Domyślną przyspieszenie ruchu głowicy drukującej.

# machine_acceleration label
source: Default Acceleration
pl: Domyślne przyspieszenie

# machine_center_is_zero description
source: Whether the X/Y coordinates of the zero position of the printer is at the center of the printable area.
pl: Określa, czy X / Y współrzędne położenia zerowego drukarki znajdują się w środku obszaru wydruku.

# machine_center_is_zero label
source: Is center origin
pl: Jest centralnym źródłem

# machine_depth description
source: The depth (Y-direction) of the printable area.
pl: Głębokość (w kierunku Y) obszaru drukowania.

# machine_depth label
source: Machine depth
pl: Głębokość drukarki

# machine_disallowed_areas description
source: A list of polygons with areas the print head is not allowed to enter.
pl: Lista wielokątów z obszarów, które nie są dopuszczone do głowicy drukującej.

# machine_disallowed_areas label
source: Disallowed areas
pl: Zakazane obszary

# machine_end_gcode description
source: Gcode commands to be executed at the very end - separated by .
pl: Polecenia G-kodu są wykonywane na samym końcu - oddzielone .

# machine_end_gcode label
source: End GCode
pl: Koniec G-kodu

# machine_extruder_count description
source: Number of extruder trains. An extruder train is the combination of a feeder, bowden tube, and nozzle.
pl: Liczba pociągów wytłaczarek. Pociąg wytłaczający jest połączeniem podajnika, rurki bowdenowej i dyszy.

# machine_extruder_count label
source: Number of Extruders
pl: Numer głowicy drukującej.

# machine_filament_park_distance description
source: The distance from the tip of the nozzle where to park the filament when an extruder is no longer used.
pl: Odległość od końcówki dyszy, w którym włókno jest zaparkowany, gdy wytłaczarka nie jest wykorzystywana.

# machine_filament_park_distance label
source: Filament Park Distance
pl: Odległość Parku filamentowego

# machine_gcode_flavor description
source: The type of gcode to be generated.
pl: Typ gcode, który ma zostać wygenerowany.

# machine_gcode_flavor label
source: Gcode flavour
pl: G-kod wersja

# machine_gcode_flavor option Griffin
source: Griffin
pl: Nowicjusz

# machine_gcode_flavor option RepRap (Volumatric)
source: RepRap (Volumetric)
pl: RepRap (Volumetrisch)

# machine_head_polygon description
source: A 2D silhouette of the print head (fan caps excluded).
pl: 2D kontur głowicy drukującej (bez nasadki wentylatora).

# machine_head_polygon label
source: Machine head polygon
pl: Urządzenie głowica wielokąta

# machine_head_with_fans_polygon description
source: A 2D silhouette of the print head (fan caps included).
pl: 2D kontur głowicy drukującej (caps wentylatora w zestawie).

# machine_head_with_fans_polygon label
source: Machine head & Fan polygon
pl: Głowica urządzenia i wentylator wielokąta

# machine_heat_zone_length description
source: The distance from the tip of the nozzle in which heat from the nozzle is transferred to the filament.
pl: Odległość od końcówki dyszy, w której ciepło z dyszy jest przenoszone do włókna ciągłego.
