Repository: GregValiant/CuraMaster
Catalog: resources/i18n/*/fdmprinter.def.json.po
Languages: pl

# retraction_speed description
source: The speed at which the filament is retracted and primed during a retraction move.
pl: Prędkość, z jaką włókna są wycofywane i zagruntowane podczas ruchu wycofywania.

# retraction_speed label
source: Retraction Speed
pl: Prędkość wycofania

# shell description
source: Shell
pl: Szkielet

# shell label
source: Shell
pl: Szkielet

# skin_alternate_rotation description
source: Alternate the direction in which the top/bottom layers are printed. Normally they are printed diagonally only. This setting adds the X-only and Y-only directions.
pl: Kierunek, w którym górne / dolne warstwy są drukowane są zmieniane. Zazwyczaj są one drukowane na ukos. Ustawienie to zwiększa tylko X i Y tylko kierunku.

# skin_alternate_rotation label
source: Alternate Skin Rotation
pl: Zmiana obrotów zewnętrznego pokrycia

# skin_angles description
source: A list of integer line directions to use when the top/bottom layers use the lines or zig zag pattern. Elements from the list are used sequentially as the layers progress and when the end of the list is reached, it starts at the beginning again. The list items are separated by commas and the whole list is contained in square brackets. Default is an empty list which means use the traditional default angles (45 and 135 degrees).
pl: Lista kierunków linii całkowitych używanych, gdy warstwy górne / dolne używają linii lub wzoru zygzakowego. Elementy z listy są używane kolejno w miarę postępu warstw, a kiedy kończy się lista, zaczyna się od początku. Elementy listy są oddzielone przecinkami, a cała lista znajduje się w nawiasach kwadratowych. Domyślnie jest pusta lista, która oznacza tradycyjne domyślne kąty (45 i 135 stopni).

# skin_angles label
source: Top/Bottom Line Directions
pl: Kierunki górnej / dolnej linii

# skin_line_width description
source: Width of a single top/bottom line.
pl: Szerokość pojedynczej górnej / dolnej linii.

# skin_line_width label
source: Top/Bottom Line Width
pl: Szerokość górnej / dolnej linii

# skin_no_small_gaps_heuristic description
source: When the model has small vertical gaps, about 5% extra computation time can be spent on generating top and bottom skin in these narrow spaces. In such case, disable the setting.
pl: Jeśli model ma małe, pionowe szczeliny, to w tych wąskich przestrzeniach można wydać około 5% dodatkowego czasu obliczeniowego. W takim przypadku wyłączyć ustawienie.

# skin_no_small_gaps_heuristic label
source: Ignore Small Z Gaps
pl: Zignoruj małe luki Z

# skin_outline_count description
source: Replaces the outermost part of the top/bottom pattern with a number of concentric lines. Using one or two lines improves roofs that start on infill material.
pl: Zastępuje najbardziej zewnętrzną część wzoru górnego / dolnego za pomocą kilku koncentrycznych linii. Korzystanie z jednej lub dwóch linii poprawia dachy, które zaczynają się od materiału wypełniającego.

# skin_outline_count label
source: Extra Skin Wall Count
pl: Numer linii dodatkowej zewnętrznej skóry

# skin_overlap description
source: The amount of overlap between the skin and the walls. A slight overlap allows the walls to connect firmly to the skin.
pl: Ilość nakładania się powłoki zewnętrznej i ścian. Lekkie nałożenie pozwala ściśle łączyć się z powłoką zewnętrzną

# skin_overlap label
source: Skin Overlap Percentage
pl: Zakładka nakładania powłoki zewnętrznej

# skin_overlap_mm description
source: The amount of overlap between the skin and the walls. A slight overlap allows the walls to connect firmly to the skin.
pl: Ilość nakładania powłoki i ścian. Lekkie nałożenie pozwala ściśle łączyć się ze powłoką.

# skin_overlap_mm label
source: Skin Overlap
pl: Nasunięcie się warstw na siebie powłoki zewnętrznej

# skirt_brim_line_width description
source: Width of a single skirt or brim line.
pl: Szerokość pojedynczej linii Skirt lub Brim

# skirt_brim_line_width label
source: Skirt/Brim Line Width
pl: Skirt- (spódnica) / Brim- (rondo) Szerokość linii

# skirt_brim_minimal_length description
source: The minimum length of the skirt or brim. If this length is not reached by all skirt or brim lines together, more skirt or brim lines will be added until the minimum length is reached. Note: If the line count is set to 0 this is ignored.
pl: Minimalna długość obwódki lub obrzeża. Jeśli ta długość nie zostanie osiągnięta przez całą linie obwodową lub obwódkę, należy dodać więcej linii brzegowych, aż do osiągnięcia minimalnej długości. Uwaga: Jeśli liczba wierszy jest ustawiona na 0, to jest ignorowana.

# skirt_brim_minimal_length label
source: Skirt/Brim Minimum Length
pl: Minimalna długość Obwódki/Obrzeża Skirt/Brim

# skirt_brim_speed description
source: The speed at which the skirt and brim are printed. Normally this is done at the initial layer speed, but sometimes you might want to print the skirt or brim at a different speed.
pl: Prędkość, z jaką jest drukowana spódnica i brzeg-obręcz (Skirt/Brim). Zwykle jest to wykonywane przy początkowej szybkości warstwy, ale czasami można wydrukować spódnicę lub obręcz przy innej prędkości.

# skirt_brim_speed label
source: Skirt/Brim Speed
pl: Prędkość Skirt/Brim

# skirt_gap description
source: The horizontal distance between the skirt and the first layer of the print. This is the minimum distance, multiple skirt lines will extend outwards from this distance.
pl: Pozioma odległość między linią wokół modelu a pierwszą warstwą nadruku. Jest to o minimalnej odległości. Z tej odległości linie montowane są w zewnętrznym kierunku.

# skirt_gap label
source: Skirt Distance
pl: Odległość obwódki od modelu

# skirt_line_count description
source: Multiple skirt lines help to prime your extrusion better for small models. Setting this to 0 will disable the skirt.
pl: Liczne linie wokół pomagają w lepszym wytłaczaniu małych modeli. Ustawienie na 0 spowoduje wyłączenie obwódki.

# skirt_line_count label
source: Skirt Line Count
pl: Obwódka liczba linii

# smooth_spiralized_contours description
source: Smooth the spiralized contours to reduce the visibility of the Z seam (the Z-seam should be barely visible on the print but will still be visible in the layer view). Note that smoothing will tend to blur fine surface details.
pl: Wygładź kontur spirali, aby zmniejszyć widoczność szwu Z (szkielet Z powinien być ledwo widoczny na wydruku, ale nadal będzie widoczny w widoku warstwy). Należy pamiętać, że wygładzanie będzie miało tendencję do rozmycia drobnych szczegółów powierzchni.

# smooth_spiralized_contours label
source: Smooth Spiralized Contours
pl: Gładkie Spiralne kontury

# spaghetti_flow description
source: Adjusts the density of the spaghetti infill. Note that the Infill Density only controls the line spacing of the filling pattern, not the amount of extrusion for spaghetti infill.
pl: Dostosowuje gęstość wypełnienia spaghetti. Należy zauważyć, że Gęstość wypełnienia tylko kontroluje rozstaw linii wzoru napełniania, a nie ilość wytłaczania wypełnienia spaghetti.

# spaghetti_flow label
source: Spaghetti Flow
pl: Spaghetti-przepływ

# spaghetti_infill_enabled description
source: Print the infill every so often, so that the filament will curl up chaotically inside the object. This reduces print time, but the behaviour is rather unpredictable.
pl: Drukowanie wypełnienia tak często, aby włókno zwisało chaotycznie wewnątrz przedmiotu. Zmniejsza to czas drukowania, ale zachowanie jest raczej nieprzewidywalne.

# spaghetti_infill_enabled label
source: Spaghetti Infill
pl: Spaghetti wypełnienia

# spaghetti_inset description
source: The offset from the walls from where the spaghetti infill will be printed.
pl: Odsunięcie od ścian, od których będzie drukowane wypełnienie spaghetti.

# spaghetti_inset label
source: Spaghetti Inset
pl: Spaghetti-wkład

# spaghetti_max_height description
source: The maximum height of inside space which can be combined and filled from the top.
pl: Maksymalna wysokość przestrzeni wewnętrznej, którą można łączyć i napełniać z góry.

# spaghetti_max_height label
source: Spaghetti Infill Maximum Height
pl: Spaghetti wypełnia maksymalną wysokość

# spaghetti_max_infill_angle description
source: The maximum angle w.r.t. the Z axis of the inside of the print for areas which are to be filled with spaghetti infill afterwards. Lowering this value causes more angled parts in your model to be filled on each layer.
pl: Maksymalny kąt w.r.t. Oś Z wewnątrz wydruku dla obszarów, które mają być wypełnione wypełnieniem spaghetti. Obniżenie tej wartości powoduje, że na każdym wariancie zostaną wypełnione więcej części pod kątem w modelu.

# spaghetti_max_infill_angle label
source: Spaghetti Maximum Infill Angle
pl: Spaghetti maksymalny kąt wypełnienia

# speed description
source: Speed
pl: Prędkość

# speed label
source: Speed
pl: Prędkość

# speed_equalize_flow_enabled description
source: Print thinner than normal lines faster so that the amount of material extruded per second remains the same. Thin pieces in your model might require lines printed with smaller line width than provided in the settings. This setting controls the speed changes for such lines.
pl: Wydrukuj cieńsze niż normalne linie szybciej, tak aby ilość materiału wytłaczanego na sekundę pozostała taka sama. Cienkie części modelu mogą wymagać drukowania linii o mniejszej szerokości linii niż podane w ustawieniach. To ustawienie kontroluje zmiany prędkości dla takich linii.

# speed_equalize_flow_enabled label
source: Equalize Filament Flow
pl: Równowaga przepływu dyszy

# speed_equalize_flow_max description
source: Maximum print speed when adjusting the print speed in order to equalize flow.
pl: Maksymalna prędkość drukowania podczas ustawiania prędkości druku w celu wyrównywania przepływu.

# speed_equalize_flow_max label
source: Maximum Speed for Flow Equalization
pl: Maksymalna prędkość dla wyrównania przepływu

# speed_infill description
source: The speed at which infill is printed.
pl: Szybkość, przy której wypełnienie jest drukowane.

# speed_infill label
source: Infill Speed
pl: Prędkość wypełnienia

# speed_layer_0 description
source: The speed for the initial layer. A lower value is advised to improve adhesion to the build plate.
pl: Prędkość dla pierwszej warstwy. Niższa wartość jest zalecane w celu poprawy przyczepności do płyty drukarskiej.

# speed_layer_0 label
source: Initial Layer Speed
pl: Szybkość pierwszej warstwy

# speed_prime_tower description
source: The speed at which the prime tower is printed. Printing the prime tower slower can make it more stable when the adhesion between the different filaments is suboptimal.
pl: Prędkość, z jaką drukowana jest pierwszorzędna wieża. Drukowanie głowicy głównej wolniej może sprawić, że będzie ona bardziej stabilna, gdy adhezja między różnymi włóknami jest nieopłacalna.

# speed_prime_tower label
source: Prime Tower Speed
pl: Prędkość, z jaką drukowana jest pierwszorzędna wieża.

# speed_print description
source: The speed at which printing happens.
pl: Prędkość druku.

# speed_print label
source: Print Speed
pl: Prędkość drukowania

# speed_print_layer_0 description
source: The speed of printing for the initial layer. A lower value is advised to improve adhesion to the build plate.
pl: Szybkość drukowania dla pierwszej warstwy. Niższa wartość jest zalecane w celu poprawy przyczepności do płyty drukarskiej.

# speed_print_layer_0 label
source: Initial Layer Print Speed
pl: Szybkość drukowania do pierwszej warstwy

# speed_slowdown_layers description
source: The first few layers are printed slower than the rest of the model, to get better adhesion to the build plate and improve the overall success rate of prints. The speed is gradually increased over these layers.
pl: Pierwsze warstwy są drukowane wolniej niż w pozostałej części modelu, więc lepiej przylegają do łóżka druku i zwiększyć prawdopodobieństwo pomyślnego ciśnieniem. Prędkość wzrasta stopniowo w czasie produkcji tych warstw.

# speed_slowdown_layers label
source: Number of Slower Layers
pl: Ilość wolnych warstw

# speed_support description
source: The speed at which the support structure is printed. Printing support at higher speeds can greatly reduce printing time. The surface quality of the support structure is not important since it is removed after printing.
pl: Szybkość, z jaką struktura nośna jest drukowana. Drukując konstrukcję podporową przy wyższych prędkościach, całkowity czas drukowania może być znacznie zmniejszona. Jakość powierzchni konstrukcji nośnej nie ma znaczenia, ponieważ jest on usuwany po drukowaniu.

# speed_support label
source: Support Speed
pl: Prędkość podpór

# speed_support_bottom description
source: The speed at which the floor of support is printed. Printing it at lower speed can improve adhesion of support on top of your model.
pl: Prędkość, z jaką drukowana jest podpórka. Drukowanie z niższą prędkością może poprawić przyczepność podpory nad modelem.

# speed_support_bottom label
source: Support Floor Speed
pl: Prędkosć drukowanych podpór dolnych/podłogi

# speed_support_infill description
source: The speed at which the infill of support is printed. Printing the infill at lower speeds improves stability.
pl: Prędkość, z jaką drukowany jest wypełnienie podłoża. Drukowanie wypełnień przy niższych prędkościach poprawia stabilność.

# speed_support_infill label
source: Support Infill Speed
pl: Prędkość wypełnienia podpór

# speed_support_interface description
source: The speed at which the roofs and floors of support are printed. Printing them at lower speeds can improve overhang quality.
pl: Szybkość, z jaką dachy i podłogi konstrukcji nośnej mają zostać wydrukowane. Drukując z mniejszą prędkością, jakość nawisy można poprawić.

# speed_support_interface label
source: Support Interface Speed
pl: Prędkość interfejsu wsparcia

# speed_support_roof description
source: The speed at which the roofs of support are printed. Printing them at lower speeds can improve overhang quality.
pl: Prędkość, w jakiej są drukowane nad dachami podparcia. Drukowanie przy niższych prędkościach może poprawić jakość zwisu.

# speed_support_roof label
source: Support Roof Speed
pl: Prędkość drukowanych podpór zwisów/dachu

# speed_topbottom description
source: The speed at which top/bottom layers are printed.
pl: Szybkość, przy której górne / dolne warstwy druku są drukowane.

# speed_topbottom label
source: Top/Bottom Speed
pl: Prędkość górnej / dolnej warstwy

# speed_travel description
source: The speed at which travel moves are made.
pl: Prędkość, w jakiej wykonywane są przemieszczenia.

# speed_travel label
source: Travel Speed
pl: Szybkość przemieszczania

# speed_travel_layer_0 description
source: The speed of travel moves in the initial layer. A lower value is advised to prevent pulling previously printed parts away from the build plate. The value of this setting can automatically be calculated from the ratio between the Travel Speed and the Print Speed.
pl: Prędkość przesuwa się w początkowej warstwie. Zaleca się niższą wartość, aby zapobiec ciągnięciu wcześniej wydrukowanych części z płyty montażowej. Wartość tego ustawienia może być automatycznie obliczana na podstawie stosunku prędkości podróży i prędkości druku.

# speed_travel_layer_0 label
source: Initial Layer Travel Speed
pl: Prędkość ruchu dla pierwszej warstwy

# speed_wall description
source: The speed at which the walls are printed.
pl: Prędkość drukowania ścian.

# speed_wall label
source: Wall Speed
pl: Szybkość ściany

# speed_wall_0 description
source: The speed at which the outermost walls are printed. Printing the outer wall at a lower speed improves the final skin quality. However, having a large difference between the inner wall speed and the outer wall speed will affect quality in a negative way.
pl: Szybkość, przy której ścianki zewnętrzne są drukowane. Drukując zewnętrzną ściankę w niższej prędkości, lepsza jakośś końcowa powłoki zewnętrznej jest osiągnięta. Jednakże, jeśli nie ma między prędkością ściany wewnętrznej i ściany zewnętrznej, że dla zbyt wielkiej różnicy, jakość jest niekorzystna.

# speed_wall_0 label
source: Outer Wall Speed
pl: Zewnętrzna ściana prędkość

# speed_wall_x description
source: The speed at which all inner walls are printed. Printing the inner wall faster than the outer wall will reduce printing time. It works well to set this in between the outer wall speed and the infill speed.
pl: Szybkość, przy której wszystkie ściany wewnętrzne są drukowane. Gdy ścianka wewnętrzna jest większa od zewnętrznej ściany drukowanej czas drukowania zmniejsza się. Zaleca się, aby to prędkości między prędkością ścianki zewnętrznej i prędkości wypełnienia.

# speed_wall_x label
source: Inner Wall Speed
pl: Prędkość wewnętrznej ściany

# start_layers_at_same_position description
source: In each layer start with printing the object near the same point, so that we don't start a new layer with printing the piece which the previous layer ended with. This makes for better overhangs and small parts, but increases printing time.
pl: W każdej warstwie zaczynają się drukowanie przedmiotu w tym samym punkcie, abyśmy nie zaczęli nowej warstwy z nadrukiem kawałka, który poprzednia warstwa się skończyła. Powoduje to lepsze zwisanie i małe części, ale zwiększa czas drukowania.

# start_layers_at_same_position label
source: Start Layers with the Same Part
pl: Uruchamianie warstw o tej samej części

# sub_div_rad_add description
source: An addition to the radius from the center of each cube to check for the boundary of the model, as to decide whether this cube should be subdivided. Larger values lead to a thicker shell of small cubes near the boundary of the model.
pl: Dodano do promienia od środka każdej kostki, aby sprawdzić granicę modelu, aby podjąć decyzję, czy taka kostka powinna być podzielona. Większe wartości prowadzą do grubszej powłoki małych kostek w pobliżu granicy modelu.

# sub_div_rad_add label
source: Cubic Subdivision Shell
pl: Sześcian

# support description
source: Support
pl: Konstrukcja nośna/Podpora

# support label
source: Support
pl: Konstrukcja nośna/Podpora

# support_angle description
source: The minimum angle of overhangs for which support is added. At a value of 0° all overhangs are supported, 90° will not provide any support.
pl: Minimalny kąt zwisu, dla którego dodano podporę. Przy wartości 0 ° wszystkie wsporniki są podparte, 90 ° nie zapewnia żadnego podparcia.

# support_angle label
source: Support Overhang Angle
pl: Kąt dla konstrukcji nośnej zwisy

# support_bottom_density description
source: The density of the floors of the support structure. A higher value results in better adhesion of the support on top of the model.
pl: Gęstość podłóg konstrukcji nośnej. Wyższa wartość powoduje lepszą adhezję podpory nad modelem.

# support_bottom_density label
source: Support Floor Density
pl: Gęstość podłogi nośnej

# support_bottom_distance description
source: Distance from the print to the bottom of the support.
pl: Odległość od nadruku do dolnej części wspornika.

# support_bottom_distance label
source: Support Bottom Distance
pl: Dolny rozstaw konstrukcji nośnej

# support_bottom_enable description
source: Generate a dense slab of material between the bottom of the support and the model. This will create a skin between the model and support.
pl: Generuje gęstą warstwę materiału pomiędzy spodem konstrukcji nośnej i modelu. To tworzy skórę pomiędzy modelem a konstrukcją nośną.

# support_bottom_enable label
source: Enable Support Floor
pl: Włącz podstawę nośną

# support_bottom_extruder_nr description
source: The extruder train to use for printing the floors of the support. This is used in multi-extrusion.
pl: Element wytłaczarki do drukowania na konstrukcji nośnej na podłożu. Służy do multi-ekstruzji.

# support_bottom_extruder_nr label
source: Support Floor Extruder
pl: Wytłaczarka do struktury podłoża

# support_bottom_height description
source: The thickness of the support floors. This controls the number of dense layers that are printed on top of places of a model on which support rests.
pl: Grubość płyt nośnych. Steruje liczbę zwartych warstw, które są drukowane z modelem, w którym konstrukcja nośna spoczywa.

# support_bottom_height label
source: Support Floor Thickness
pl: Grubość struktury podłogi

# support_bottom_line_distance description
source: Distance between the printed support floor lines. This setting is calculated by the Support Floor Density, but can be adjusted separately.
pl: Odległość między drukowanymi liniami podłogowymi podparcia. To ustawienie jest obliczane za pomocą Gęstości podłogi podpór, ale można je wyregulować oddzielnie.

# support_bottom_line_distance label
source: Support Floor Line Distance
pl: Odstęp linii struktury podłoża

# support_bottom_line_width description
source: Width of a single support floor line.
pl: Szerokość pojedynczej podpory.

# support_bottom_line_width label
source: Support Floor Line Width
pl: Konstrukcja nośna szerokość dolna linia

# support_bottom_pattern description
source: The pattern with which the floors of the support are printed.
pl: Wzorzec, z którym drukowane są podłoża.

# support_bottom_pattern label
source: Support Floor Pattern
pl: Wzorzec Podłogi Wsparcia

# support_bottom_pattern option concentric
source: Concentric
pl: Koncentryczny

# support_bottom_pattern option concentric_3d
source: Concentric 3D
pl: Koncentryczny 3D

# support_bottom_pattern option grid
source: Grid
pl: Kratka

# support_bottom_pattern option lines
source: Lines
pl: Liniowy

# support_bottom_pattern option triangles
source: Triangles
pl: Trójkąty

# support_bottom_pattern option zigzag
source: Zig Zag
pl: Zygzak

# support_bottom_stair_step_height description
source: The height of the steps of the stair-like bottom of support resting on the model. A low value makes the support harder to remove, but too high values can lead to unstable support structures. Set to zero to turn off the stair-like behaviour.
pl: Wysokość schodów schody podstawy w kształcie struktury nośnej modelu. Niska wartość może usunięcie konstrukcji nośnej, ale zbyt duża wartość może prowadzić do niestabilnej konstrukcji wsporczych. Ustawiony na zero, aby wyłączyć odpowiedzi skokowej.

# support_bottom_stair_step_height label
source: Support Stair Step Height
pl: Wysokość stopnia konstrukcji wsporczej

# support_bottom_stair_step_width description
source: The maximum width of the steps of the stair-like bottom of support resting on the model. A low value makes the support harder to remove, but too high values can lead to unstable support structures.
pl: Maksymalna szerokość stopni stopnia schodowego podpory oparta na modelu. Niska wartość sprawia, że wsparcie jest trudniejsze do usunięcia, ale zbyt wysokie wartości mogą prowadzić do niestabilnych struktur podparcia.

# support_bottom_stair_step_width label
source: Support Stair Step Maximum Width
pl: Maks. Wysokość stopnia od konstrukcji wsporczej

# support_conical_angle description
source: The angle of the tilt of conical support. With 0 degrees being vertical, and 90 degrees being horizontal. Smaller angles cause the support to be more sturdy, but consist of more material. Negative angles cause the base of the support to be wider than the top.
pl: Kąt nachylenia stożkowego podparcia. Przy 0 stopniach jest pionowa i 90 stopni w poziomie. Mniejsze kąty sprawiają, że podparcie jest bardziej wytrzymałe, ale składa się z większej ilości materiału. Kąty ujemne powodują, że podstawa wspornika jest szersza niż górna.

# support_conical_angle label
source: Conical Support Angle
pl: Kąt stożkowy konstrukcji wsporczej

# support_conical_enabled description
source: Experimental feature: Make support areas smaller at the bottom than at the overhang.
pl: Eksperymentalna cecha: W dolnym obszarze podpory powinny być mniejsze niż na zwisie.
