Repository: GregValiant/CuraMaster
Catalog: resources/i18n/*/fdmprinter.def.json.po
Languages: pl

# acceleration_enabled description
source: Enables adjusting the print head acceleration. Increasing the accelerations can reduce printing time at the cost of print quality.
pl: Umożliwia regulację przyspieszenia głowicy drukującej. Wzrost przyspieszeń może skrócić czas drukowania kosztem jakości druku.

# acceleration_enabled label
source: Enable Acceleration Control
pl: Włącz sterowanie przyspieszeniem

# acceleration_infill description
source: The acceleration with which infill is printed.
pl: Przyspieszenie z którym wypełnienie jest drukowane.

# acceleration_infill label
source: Infill Acceleration
pl: Przyspieszenie wypełnienia

# acceleration_layer_0 description
source: The acceleration for the initial layer.
pl: Przyspieszenie dla początkowej warstwy.

# acceleration_layer_0 label
source: Initial Layer Acceleration
pl: Pierwsza warstwa przyspieszenie

# acceleration_prime_tower description
source: The acceleration with which the prime tower is printed.
pl: Przyspieszenie, z którym drukowana jest pierwszorzędna wieża.

# acceleration_prime_tower label
source: Prime Tower Acceleration
pl: Przyspieszenie pierwszorzędnej wieży.

# acceleration_print description
source: The acceleration with which printing happens.
pl: Przyspieszenie, z jakim odbywa się drukowanie.

# acceleration_print label
source: Print Acceleration
pl: Przyspieszenie druku (Acceleration)

# acceleration_print_layer_0 description
source: The acceleration during the printing of the initial layer.
pl: Przyspieszenie podczas drukowania pierwszej warstwy.

# acceleration_print_layer_0 label
source: Initial Layer Print Acceleration
pl: Początkowe przyspieszenie drukowania warstw

# acceleration_skirt_brim description
source: The acceleration with which the skirt and brim are printed. Normally this is done with the initial layer acceleration, but sometimes you might want to print the skirt or brim at a different acceleration.
pl: Przyspieszenia, z którymi Skirt- i brzegi-elementy druku. Typowo, następuje przyspieszenie warstwy bazowej używany. W niektórych przypadkach może być korzystne, jednak, aby wydrukować Skirt- lub Brim elementu z innym przyspieszenia.

# acceleration_skirt_brim label
source: Skirt/Brim Acceleration
pl: Przyspieszenie Skirt / Brim

# acceleration_support description
source: The acceleration with which the support structure is printed.
pl: Przyspieszenie z której konstrukcja nośna jest drukowana.

# acceleration_support label
source: Support Acceleration
pl: Konstrukcja podpór przyspieszenie

# acceleration_support_bottom description
source: The acceleration with which the floors of support are printed. Printing them at lower acceleration can improve adhesion of support on top of your model.
pl: Przyspieszenie, z jakim są drukowane podłoża. Drukowanie przy niższym przyspieszeniu może poprawić adhezję wsparcia nad modelem.

# acceleration_support_bottom label
source: Support Floor Acceleration
pl: Przyspieszenie struktury podłoża

# acceleration_support_infill description
source: The acceleration with which the infill of support is printed.
pl: Przyspieszenie z których wypełnienie konstrukcji nośnej jest drukowane.

# acceleration_support_infill label
source: Support Infill Acceleration
pl: Przyspieszenie struktury wsparcia wypełnienia.

# acceleration_support_interface description
source: The acceleration with which the roofs and floors of support are printed. Printing them at lower acceleration can improve overhang quality.
pl: Przyspieszenie, z jaką są drukowane dachy i podłogi podpory. Drukowanie przy niższym przyspieszeniu może poprawić jakość zwisu.

# acceleration_support_interface label
source: Support Interface Acceleration
pl: Przyspieszenie interfejs konstrukcja nośna

# acceleration_support_roof description
source: The acceleration with which the roofs of support are printed. Printing them at lower acceleration can improve overhang quality.
pl: Przyspieszenia, z którymi dachów konstrukcji nośnej do wydrukowania. Drukując na niższym przyspieszeniem, jakość wystające może być poprawiona.

# acceleration_support_roof label
source: Support Roof Acceleration
pl: Konstrukcja dachu przyspieszenie

# acceleration_topbottom description
source: The acceleration with which top/bottom layers are printed.
pl: Przyspieszenie w którym górne / dolne warstwy druku.

# acceleration_topbottom label
source: Top/Bottom Acceleration
pl: Przyspieszenie w górę / w dół

# acceleration_travel description
source: The acceleration with which travel moves are made.
pl: Przyspieszenie, z jaką wykonywane są przemieszczenia.

# acceleration_travel label
source: Travel Acceleration
pl: Przyspieszenie podróży

# acceleration_travel_layer_0 description
source: The acceleration for travel moves in the initial layer.
pl: Przyspieszenie ruchu napędu pierwszej warstwy.

# acceleration_travel_layer_0 label
source: Initial Layer Travel Acceleration
pl: Prędkość ruchu dla pierwszej warstwy

# acceleration_wall description
source: The acceleration with which the walls are printed.
pl: Przyspieszenie z którym ściany są drukowane.

# acceleration_wall label
source: Wall Acceleration
pl: Przyspieszenie ściany

# acceleration_wall_0 description
source: The acceleration with which the outermost walls are printed.
pl: Przyspieszenia, z którym ściany zewnętrzne są drukowane.

# acceleration_wall_0 label
source: Outer Wall Acceleration
pl: Przyspieszenie zewnętrzna ściana

# acceleration_wall_x description
source: The acceleration with which all inner walls are printed.
pl: Przyspieszenie z których wewnętrzne ścianki są drukowane.

# acceleration_wall_x label
source: Inner Wall Acceleration
pl: Przyspieszenie wewnętrzna ściana

# adhesion_extruder_nr description
source: The extruder train to use for printing the skirt/brim/raft. This is used in multi-extrusion.
pl: Element wytłaczarki do drukowania Obwódki / Obrzeża / Tratwy. Służy do multi-ekstruzji.

# adhesion_extruder_nr label
source: Build Plate Adhesion Extruder
pl: Wytłaczarka do wytłaczania płyt warstwowych

# adhesion_type description
source: Different options that help to improve both priming your extrusion and adhesion to the build plate. Brim adds a single layer flat area around the base of your model to prevent warping. Raft adds a thick grid with a roof below the model. Skirt is a line printed around the model, but not connected to the model.
pl: Różne opcje, które pomogą poprawić zarówno wypalanie wytłoczenia, jak i przyczepność do płytki. Brim dodaje jednowarstwową płaską powierzchnię wokół podstawy modelu, aby zapobiec wypaczeniu. Raft dodaje grubą siatkę z dachem poniżej modelu. Spódnica to linia nadrukowana wokół modelu, ale nie połączona z modelem.

# adhesion_type label
source: Build Plate Adhesion Type
pl: Podaj typ przyczepności płyty

# adhesion_type option brim
source: Brim
pl: Obrzeże/Brim

# adhesion_type option none
source: None
pl: Żaden

# adhesion_type option raft
source: Raft
pl: Tratwa

# adhesion_type option skirt
source: Skirt
pl: Obwódka/Skirt

# alternate_carve_order description
source: Switch to which mesh intersecting volumes will belong with every layer, so that the overlapping meshes become interwoven. Turning this setting off will cause one of the meshes to obtain all of the volume in the overlap, while it is removed from the other meshes.
pl: Przełączanie, w które będą się przecinały siatki, będą przychodzić z każdą warstwą, tak, aby zachodzące na siebie siatki się wzajemnie splatały. Wyłączenie tej opcji spowoduje, że jeden z oczek będzie mógł pobrać całą objętość na zakładce, podczas gdy jest usuwany z innych oczek.

# alternate_carve_order label
source: Alternate Mesh Removal
pl: Zmiana usunięcie sieci

# alternate_extra_perimeter description
source: Prints an extra wall at every other layer. This way infill gets caught between these extra walls, resulting in stronger prints.
pl: W ten sposób wypełnienie zostaje złapane między tymi dodatkowymi ścianami, powodując silniejsze odruchy.

# alternate_extra_perimeter label
source: Alternate Extra Wall
pl: Alternatywna dodatkowa ściana

# anti_overhang_mesh description
source: Use this mesh to specify where no part of the model should be detected as overhang. This can be used to remove unwanted support structure.
pl: Sieć ta służy do określenia, która część modelu ma być rozpoznany jako zwis. Może być stosowany do usuwania niechcianych konstrukcję nośną.

# anti_overhang_mesh label
source: Anti Overhang Mesh
pl: Anti-zwis sieć

# blackmagic description
source: category_blackmagic
pl: Czarna magia kategorii

# blackmagic label
source: Special Modes
pl: Specjalne tryby

# bottom_layers description
source: The number of bottom layers. When calculated by the bottom thickness, this value is rounded to a whole number.
pl: Liczba warstw dolnych. Przy obliczaniu dolnej grubości ta wartość jest zaokrąglana do liczby całkowitej.

# bottom_layers label
source: Bottom Layers
pl: Dolne warstwy

# bottom_thickness description
source: The thickness of the bottom layers in the print. This value divided by the layer height defines the number of bottom layers.
pl: Grubość dolnych warstw w druku. Ta wartość podzielona przez wysokość warstwy definiuje liczbę warstw dolnych.

# bottom_thickness label
source: Bottom Thickness
pl: Redukcja grubości

# brim_line_count description
source: The number of lines used for a brim. More brim lines enhance adhesion to the build plate, but also reduces the effective print area.
pl: Liczba linii dla elementu obrzeży. Większa liczba obrzeży linii poprawia przyczepność do stołu ale to również zmniejsza powierzchnię użytkową druku.

# brim_line_count label
source: Brim Line Count
pl: Liczba linii obrzeża

# brim_outside_only description
source: Only print the brim on the outside of the model. This reduces the amount of brim you need to remove afterwards, while it doesn't reduce the bed adhesion that much.
pl: Obrzeże drukować tylko na zewnątrz modelu. Daje to liczbę ronda, które trzeba usunąć później, podczas drukowania pole stołu jest znacznie ograniczone zmniejszone.

# brim_outside_only label
source: Brim Only on Outside
pl: Obrzeża tylko na zewnątrz

# brim_width description
source: The distance from the model to the outermost brim line. A larger brim enhances adhesion to the build plate, but also reduces the effective print area.
pl: Odległość od modelu do najbardziej wysuniętej na zewnątrz linii. Większy obwód zwiększa adhezję do płytki, ale również zmniejsza efektywny obszar wydruku.

# brim_width label
source: Brim Width
pl: Szerokość Obrzeża/Brim

# carve_multiple_volumes description
source: Remove areas where multiple meshes are overlapping with each other. This may be used if merged dual material objects overlap with each other.
pl: Obszarach poza, w którym wiele sieci pokrywają się ze sobą. To mogą być stosowane, gdy montowane przedmioty z dwóch rodzajów materiału zachodzą na siebie.

# carve_multiple_volumes label
source: Remove Mesh Intersection
pl: Usuń przecięcie siatki

# center_object description
source: Whether to center the object on the middle of the build platform (0,0), instead of using the coordinate system in which the object was saved.
pl: Czy środek obiektu znajduje się na środku platformy kompilacji (0,0), zamiast używać układu współrzędnych, w którym został zapisany obiekt.

# center_object label
source: Center object
pl: Środek obiektu

# coasting_enable description
source: Coasting replaces the last part of an extrusion path with a travel path. The oozed material is used to print the last piece of the extrusion path in order to reduce stringing.
pl: Coasting zastępuje ostatnią część ścieżki wytłaczania ścieżką. Zużyty materiał jest używany do drukowania ostatniego kawałka ścieżki wytłaczania w celu zmniejszenia strun.

# coasting_enable label
source: Enable Coasting
pl: Włącz (Coasting)

# coasting_min_volume description
source: The smallest volume an extrusion path should have before allowing coasting. For smaller extrusion paths, less pressure has been built up in the bowden tube and so the coasted volume is scaled linearly. This value should always be larger than the Coasting Volume.
pl: Najmniejsza objętość ścieżka wytłaczania powinna mieć przed umożliwieniem wypłynięcia. W przypadku małych ścieżek wytłaczania w rurce bowden powstało mniejsze ciśnienie, a więc objętość rozbłysku jest skalowana liniowo. Ta wartość powinna zawsze być większa niż objętość przybrzeżna.

# coasting_min_volume label
source: Minimum Volume Before Coasting
pl: Minimalna objętość przed brzegiem

# coasting_speed description
source: The speed by which to move during coasting, relative to the speed of the extrusion path. A value slightly under 100% is advised, since during the coasting move the pressure in the bowden tube drops.
pl: Prędkość poruszania się podczas wybiegu, w stosunku do prędkości ścieżki wytłaczania. Zaleca się wartość nieco poniżej 100%, ponieważ podczas ruchu na brzegach ciśnienie w rurce bowden spada.

# coasting_speed label
source: Coasting Speed
pl: Prędkość wybrzeża

# coasting_volume description
source: The volume otherwise oozed. This value should generally be close to the nozzle diameter cubed.
pl: Objętość została inna. Wartość ta powinna być zasadniczo zbliżona do sześciennej średnicy dyszy.

# coasting_volume label
source: Coasting Volume
pl: Objętość przybrzeżna

# command_line_settings description
source: Settings which are only used if CuraEngine isn't called from the Cura frontend.
pl: Ustawienia, które są używane tylko wtedy, gdy CuraEngine nie jest wywoływana z frontu Cura.

# command_line_settings label
source: Command Line Settings
pl: Ustawienia wiersza polecenia

# conical_overhang_angle description
source: The maximum angle of overhangs after the they have been made printable. At a value of 0° all overhangs are replaced by a piece of model connected to the build plate, 90° will not change the model in any way.
pl: Maksymalny kąt zwisów po ich nadrukowaniu. Przy wartości 0 ° wszystkie zwisy są zastępowane przez wzór modelu połączony z płytą konstrukcyjną, a 90 ° w żaden sposób nie zmienia modelu.

# conical_overhang_angle label
source: Maximum Model Angle
pl: Maksymalny kąt modelu

# conical_overhang_enabled description
source: Change the geometry of the printed model such that minimal support is required. Steep overhangs will become shallow overhangs. Overhanging areas will drop down to become more vertical.
pl: Zmień geometrię drukowanego modelu tak, aby wymagało minimalnego podparcia. Strome zwisanie staną się płytkimi zwisami. Powtórne obszary spadną, aby stać się bardziej pionowe.

# conical_overhang_enabled label
source: Make Overhang Printable
pl: Dokonać nawisy do druku

# cool_fan_enabled description
source: Enables the print cooling fans while printing. The fans improve print quality on layers with short layer times and bridging / overhangs.
pl: Umożliwia rozruch wentylatorom drukującym podczas drukowania. Wentylatory poprawiają jakość wydruku na warstwach o krótkich czasach warstwy i mostkach / zwisach.

# cool_fan_enabled label
source: Enable Print Cooling
pl: Włącz chłodzenie wydruku

# cool_fan_full_at_height description
source: The height at which the fans spin on regular fan speed. At the layers below the fan speed gradually increases from Initial Fan Speed to Regular Fan Speed.
pl: Wysokość, na jaką wirują wentylatorki na regularnej prędkości wentylatora. W warstwach poniżej prędkości wentylatora stopniowo wzrasta od początkowej prędkości wentylatora do stałej prędkości wentylatora.

# cool_fan_full_at_height label
source: Regular Fan Speed at Height
pl: Normalna prędkość wentylatora na wysokości

# cool_fan_full_layer description
source: The layer at which the fans spin on regular fan speed. If regular fan speed at height is set, this value is calculated and rounded to a whole number.
pl: Warstwa, w której wirują wentylatorki o regularnej prędkości wentylatora. Jeśli ustawiona jest regularna prędkość wentylatora na wysokości, wartość ta jest obliczana i zaokrąglana na cały numer.

# cool_fan_full_layer label
source: Regular Fan Speed at Layer
pl: Normalna prędkość obrotową wentylatora w warstwie

# cool_fan_speed description
source: The speed at which the print cooling fans spin.
pl: Prędkość obrotowa wentylatorów drukujących.

# cool_fan_speed label
source: Fan Speed
pl: Prędkość wiatraka

# cool_fan_speed_0 description
source: The speed at which the fans spin at the start of the print. In subsequent layers the fan speed is gradually increased up to the layer corresponding to Regular Fan Speed at Height.
pl: Prędkość, z jaką wentylatory wirują na początku druku. W kolejnych warstwach prędkość wentylatora stopniowo wzrasta do warstwy odpowiadającej regularnej prędkości wentylatora na wysokości.

# cool_fan_speed_0 label
source: Initial Fan Speed
pl: Początkowa prędkość wentylatora

# cool_fan_speed_max description
source: The speed at which the fans spin on the minimum layer time. The fan speed gradually increases between the regular fan speed and maximum fan speed when the threshold is hit.
pl: Prędkość, z jaką wirują wentylatory w minimalnym czasie warstwy. Prędkość wentylatora stopniowo wzrasta między regularną prędkością wentylatora a maksymalną prędkością wentylatora, gdy próg zostanie uderzony.

# cool_fan_speed_max label
source: Maximum Fan Speed
pl: Maksymalna prędkość wentylatora

# cool_fan_speed_min description
source: The speed at which the fans spin before hitting the threshold. When a layer prints faster than the threshold, the fan speed gradually inclines towards the maximum fan speed.
pl: Prędkość obrotowa wentylatorów przed naciśnięciem progu. Kiedy warstwa jest drukowana szybciej niż próg, prędkość wentylatora stopniowo spada do maksymalnej prędkości wentylatora.

# cool_fan_speed_min label
source: Regular Fan Speed
pl: Normalna prędkość wentylatora

# cool_lift_head description
source: When the minimum speed is hit because of minimum layer time, lift the head away from the print and wait the extra time until the minimum layer time is reached.
pl: Jeśli zostanie osiągnięta minimalna prędkość ze względu na czas minimalnej warstwy, głowica drukująca jest podnoszony przez ciśnienie i dodatkowego czasu, aż zostanie osiągnięty minimalny czas na warstwy, czekając.

# cool_lift_head label
source: Lift Head
pl: Unieść głowicę

# cool_min_layer_time description
source: The minimum time spent in a layer. This forces the printer to slow down, to at least spend the time set here in one layer. This allows the printed material to cool down properly before printing the next layer. Layers may still take shorter than the minimal layer time if Lift Head is disabled and if the Minimum Speed would otherwise be violated.
pl: Minimalny czas spędzony w warstwie. Zmusza to drukarkę do spowolnienia, aby przynajmniej spędzić czas ustawiony tutaj w jednej warstwie. Pozwala to na właściwy wydruk przed wydrukowaniem następnej warstwy. Warstwy mogą nadal trwać krócej niż minimalny czas warstwy, jeśli Lift Head jest wyłączony, a jeśli Minimalna prędkość zostanie w inny sposób naruszona.

# cool_min_layer_time label
source: Minimum Layer Time
pl: Minimalny czas na warstwie

# cool_min_layer_time_fan_speed_max description
source: The layer time which sets the threshold between regular fan speed and maximum fan speed. Layers that print slower than this time use regular fan speed. For faster layers the fan speed gradually increases towards the maximum fan speed.
pl: Czas warstwy, który ustala próg pomiędzy regularną prędkością wentylatora a maksymalną prędkością wentylatora. Warstwy, które są drukowane wolniej niż ten czas, używają regularnej prędkości wentylatora. W przypadku szybszych warstw prędkość wentylatora stopniowo wzrasta w kierunku maksymalnej prędkości wentylatora.

# cool_min_layer_time_fan_speed_max label
source: Regular/Maximum Fan Speed Threshold
pl: Regularny / maksymalny próg prędkości wentylatora

# cool_min_speed description
source: The minimum print speed, despite slowing down due to the minimum layer time. When the printer would slow down too much, the pressure in the nozzle would be too low and result in bad print quality.
pl: Minimalna szybkość drukowania, pomimo spowolnienia z powodu minimalnego czasu warstwy. Gdy drukarka spowolniła zbyt dużo, ciśnienie w dyszy byłoby zbyt niskie i spowodowało złe jakości druku.

# cool_min_speed label
source: Minimum Speed
pl: Minimalna prędkość

# cooling description
source: Cooling
pl: Chłodzenie

# cooling label
source: Cooling
pl: Chłodzenie

# cutting_mesh description
source: Limit the volume of this mesh to within other meshes. You can use this to make certain areas of one mesh print with different settings and with a whole different extruder.
pl: Ograniczyć objętość tej siatki do innych oczek. Można to zrobić, aby niektóre obszary jednego oczka były drukowane z różnymi ustawieniami iz całością innej wytłaczarki.

# cutting_mesh label
source: Cutting Mesh
pl: Obróbka siatki

# default_material_print_temperature description
source: The default temperature used for printing. This should be the "base" temperature of a material. All other print temperatures should use offsets based on this value
pl: Domyślna temperatura używana do drukowania. Powinno to być temperatura "podstawy" materiału. Wszystkie inne temperatury drukowania powinny być wykorzystywane z przesunięciami w oparciu o tę wartość

# default_material_print_temperature label
source: Default Printing Temperature
pl: Domyślna temperatura druku

# draft_shield_dist description
source: Distance of the draft shield from the print, in the X/Y directions.
pl: Odległość projektowanej osłony od druku, w kierunkach X / Y.

# draft_shield_dist label
source: Draft Shield X/Y Distance
pl: Otwór tarczy X / Y Odległość

# draft_shield_enabled description
source: This will create a wall around the model, which traps (hot) air and shields against exterior airflow. Especially useful for materials which warp easily.
pl: Powoduje to powstanie ściany wokół modelu, która pułapuje (gorące powietrze) i osłona przed zewnętrznym strumieniem powietrza. Szczególnie przydatna w przypadku materiałów, które łatwo oswajają się.

# draft_shield_enabled label
source: Enable Draft Shield
pl: Aktywować przedniej szyby (Draft Shield)

# draft_shield_height description
source: Height limitation of the draft shield. Above this height no draft shield will be printed.
pl: Ograniczenie wysokości osłony przeciwwiatrowej. Powyżej tej wysokości nie zostanie wydrukowana talia robocza.

# draft_shield_height label
source: Draft Shield Height
pl: Wysokość osłony tarczy

# draft_shield_height_limitation description
source: Set the height of the draft shield. Choose to print the draft shield at the full height of the model or at a limited height.
pl: Ustaw wysokość osłony przeciwwiatrowej. Wybierz drukowaną osłonę na całej wysokości modelu lub na ograniczonej wysokości.

# draft_shield_height_limitation label
source: Draft Shield Limitation
pl: Ograniczenie tarczy konstrukcyjnej

# draft_shield_height_limitation option full
source: Full
pl: Pełny

# draft_shield_height_limitation option limited
source: Limited
pl: Ograniczony

# dual description
source: Settings used for printing with multiple extruders.
pl: Ustawienia używane do drukowania z wieloma głowicami drukującymi

# dual label
source: Dual Extrusion
pl: Podwójna głowica drukująca
