Repository: GregValiant/CuraMaster
Catalog: resources/i18n/*/fdmprinter.def.json.po
Languages: pl

# mold_enabled description
source: Print models as a mold, which can be cast in order to get a model which resembles the models on the build plate.
pl: Wydrukuj modele jako formę, którą można wyrzucić w celu uzyskania modelu, który przypomina modele na płycie.

# mold_enabled label
source: Mold
pl: Forma

# mold_roof_height description
source: The height above horizontal parts in your model which to print mold.
pl: Wysokość nad poziomymi częściami w modelu, które umożliwiają drukowanie formy.

# mold_roof_height label
source: Mold Roof Height
pl: Wzrost wysokości dachu

# mold_width description
source: The minimal distance between the ouside of the mold and the outside of the model.
pl: Minimalna odległość między zewnętrzną stroną śmiałego i zewnętrznego modelu.

# mold_width label
source: Minimal Mold Width
pl: Minimalna szerokość formy

# multiple_mesh_overlap description
source: Make meshes which are touching each other overlap a bit. This makes them bond together better.
pl: Utwórz siatki, które się dotykają, zachodzą na siebie. To sprawia, że lepiej się łączą.

# multiple_mesh_overlap label
source: Merged Meshes Overlap
pl: Połączone okręgi się pokrywają

# nozzle_disallowed_areas description
source: A list of polygons with areas the nozzle is not allowed to enter.
pl: Lista wielokątów z obszarami, na które dysze nie mogą wchodzić.

# nozzle_disallowed_areas label
source: Nozzle Disallowed Areas
pl: Obszary niedozwolone w dyszy

# ooze_shield_angle description
source: The maximum angle a part in the ooze shield will have. With 0 degrees being vertical, and 90 degrees being horizontal. A smaller angle leads to less failed ooze shields, but more material.
pl: Maksymalny kąt, jaki ma w osłonie osłony. Przy 0 stopniach jest pionowa i 90 stopni w poziomie. Mniejszy kąt prowadzi do mniej nieudanych ekranów, ale więcej materiału.

# ooze_shield_angle label
source: Ooze Shield Angle
pl: Kąt osłony tarcia

# ooze_shield_dist description
source: Distance of the ooze shield from the print, in the X/Y directions.
pl: Odległość od osłony śluzu od nadruku, w kierunkach X / Y.

# ooze_shield_dist label
source: Ooze Shield Distance
pl: Odległość osłony tarczy

# ooze_shield_enabled description
source: Enable exterior ooze shield. This will create a shell around the model which is likely to wipe a second nozzle if it's at the same height as the first nozzle.
pl: Włączyć zewnętrzną osłonę. Powstanie powłoka wokół modelu, która prawdopodobnie wycierpie drugą dyszę, jeśli jest na tej samej wysokości, co pierwsza dysza.

# ooze_shield_enabled label
source: Enable Ooze Shield
pl: Włącz osłony tarcia

# outer_inset_first description
source: Prints walls in order of outside to inside when enabled. This can help improve dimensional accuracy in X and Y when using a high viscosity plastic like ABS; however it can decrease outer surface print quality, especially on overhangs.
pl: Drukuje ściany w kolejności od zewnątrz do wewnątrz, gdy jest włączona. Może to poprawić dokładność wymiarów w modelach X i Y przy użyciu plastiku o wysokiej lepkości, takiego jak ABS; Może jednak zmniejszyć jakość druku zewnętrznego, zwłaszcza na zwisach.

# outer_inset_first label
source: Outer Before Inner Walls
pl: Zewnętrzne przed ścianami wewnętrznymi

# platform_adhesion description
source: Adhesion
pl: Przyczepność

# platform_adhesion label
source: Build Plate Adhesion
pl: Zbuduj przyczepność płyt

# prime_blob_enable description
source: Whether to prime the filament with a blob before printing. Turning this setting on will ensure that the extruder will have material ready at the nozzle before printing. Printing Brim or Skirt can act like priming too, in which case turning this setting off saves some time.
pl: Czy przenieść włókno z blobem przed drukowaniem. Po włączeniu tego ustawienia upewnij się, że wytłaczarka ma materiał gotowy do dyszy przed drukowaniem. Drukowanie Brim lub Skirt może działać jak gruntowanie, w takim przypadku wyłączenie tego ustawienia oszczędza trochę czasu.

# prime_blob_enable label
source: Enable Prime Blob
pl: Włącz Prime Blob

# prime_tower_enable description
source: Print a tower next to the print which serves to prime the material after each nozzle switch.
pl: Wydrukuj wieżę obok wydruku, która służy do napełniania materiału po każdym przełączniku dyszy.

# prime_tower_enable label
source: Enable Prime Tower
pl: Włącz Prime Tower

# prime_tower_flow description
source: Flow compensation: the amount of material extruded is multiplied by this value.
pl: Kompensacja przepływu: ilość materiału wytłaczanego jest mnożona przez tę wartość.

# prime_tower_flow label
source: Prime Tower Flow
pl: Przepływ/Flow Prime Tower

# prime_tower_line_width description
source: Width of a single prime tower line.
pl: Szerokość pojedynczej linii wieży.

# prime_tower_line_width label
source: Prime Tower Line Width
pl: Szerokość linii rzędu głównej wieży

# prime_tower_min_volume description
source: The minimum volume for each layer of the prime tower in order to purge enough material.
pl: Minimalna objętość każdej warstwy wieży podstawowej w celu oczyszczenia wystarczającego materiału.

# prime_tower_min_volume label
source: Prime Tower Minimum Volume
pl: Minimalna objętość Prime Tower

# prime_tower_position_x description
source: The x coordinate of the position of the prime tower.
pl: Współrzędna X położenia pierwszej wieży.

# prime_tower_position_x label
source: Prime Tower X Position
pl: Pozycja Prime Tower X

# prime_tower_position_y description
source: The y coordinate of the position of the prime tower.
pl: Współrzędna Y położenia pierwszej wieży.

# prime_tower_position_y label
source: Prime Tower Y Position
pl: Pozycja Prime Tower Y

# prime_tower_size description
source: The width of the prime tower.
pl: Szerokość wieży głównej.

# prime_tower_size label
source: Prime Tower Size
pl: Rozmiar Prime Tower

# prime_tower_wall_thickness description
source: The thickness of the hollow prime tower. A thickness larger than half the Prime Tower Minimum Volume will result in a dense prime tower.
pl: Grubość pustej wieży. Grubość większa niż połowa minimalnej objętości Prime Tower spowoduje, że wieża o dużej gęstości.

# prime_tower_wall_thickness label
source: Prime Tower Thickness
pl: Grubość Prime Tower

# prime_tower_wipe_enabled description
source: After printing the prime tower with one nozzle, wipe the oozed material from the other nozzle off on the prime tower.
pl: Po wydrukowaniu podstawowej wieży jedną dyszą przetrzyj wytłoczony materiał z drugiej dyszy na główną wieżę.

# prime_tower_wipe_enabled label
source: Wipe Inactive Nozzle on Prime Tower
pl: Wytrzeć nieaktywną dyszę na Prime Tower

# print_sequence description
source: Whether to print all models one layer at a time or to wait for one model to finish, before moving on to the next. One at a time mode is only possible if all models are separated in such a way that the whole print head can move in between and all models are lower than the distance between the nozzle and the X/Y axes.
pl: Czy drukować wszystkie modele po jednej warstwie lub poczekać na zakończenie jednego modelu, zanim przejdziesz do następnego. Jedno w trybie czasu jest możliwe tylko wtedy, gdy wszystkie modele są oddzielone w taki sposób, aby cała głowica drukująca mogła się poruszać między wszystkimi modelami niższa niż odległość między dyszą a osiami X / Y.

# print_sequence label
source: Print Sequence
pl: Wydrukuj sekwencję

# print_sequence option all_at_once
source: All at Once
pl: Wszystko na raz

# print_sequence option one_at_a_time
source: One at a Time
pl: Jedno na raz

# raft_acceleration description
source: The acceleration with which the raft is printed.
pl: Przyspieszenie, z jakim tratwa jest wydrukowana.

# raft_acceleration label
source: Raft Print Acceleration
pl: Przyspieszenie druku tratwy

# raft_airgap description
source: The gap between the final raft layer and the first layer of the model. Only the first layer is raised by this amount to lower the bonding between the raft layer and the model. Makes it easier to peel off the raft.
pl: Różnica między końcową warstwą tratwy a pierwszą warstwą modelu. Tylko ta pierwsza warstwa jest podnoszona o tę ilość w celu zmniejszenia wiązania pomiędzy warstwą tratwą a modelem. Ułatwia odrywanie tratwy.

# raft_airgap label
source: Raft Air Gap
pl: Luki w powietrzu

# raft_base_acceleration description
source: The acceleration with which the base raft layer is printed.
pl: Przyspieszenie, z jaką drukowana jest warstwa podstawowej tratwy.

# raft_base_acceleration label
source: Raft Base Print Acceleration
pl: Przyspieszenie druku tratwy bazy

# raft_base_fan_speed description
source: The fan speed for the base raft layer.
pl: Prędkość wentylatora dla podstawowej warstwy tratwy.

# raft_base_fan_speed label
source: Raft Base Fan Speed
pl: Prędkość wentylatora podstawy tratwy

# raft_base_jerk description
source: The jerk with which the base raft layer is printed.
pl: Funkcja szarpnięcie w której dolna warstwa Tratwa wydrukowaniu.

# raft_base_jerk label
source: Raft Base Print Jerk
pl: Funkcja Print szarpnięcie baza Tratwa

# raft_base_line_spacing description
source: The distance between the raft lines for the base raft layer. Wide spacing makes for easy removal of the raft from the build plate.
pl: Odległość pomiędzy linami tratwiowymi dla warstwy podstawowej tratwy. Szerokie odstępy ułatwiają usuwanie tratwy z płytki.

# raft_base_line_spacing label
source: Raft Line Spacing
pl: Rozstaw linii tratw

# raft_base_line_width description
source: Width of the lines in the base raft layer. These should be thick lines to assist in build plate adhesion.
pl: Szerokość linii w podstawowej warstwie tratwy. Powinny być to grube linie, które pomogą w przyczepianiu do płyt budowlanych.

# raft_base_line_width label
source: Raft Base Line Width
pl: Szerokość linii podstawy tratwy

# raft_base_speed description
source: The speed at which the base raft layer is printed. This should be printed quite slowly, as the volume of material coming out of the nozzle is quite high.
pl: Prędkość, w jakiej jest wydrukowana warstwa podstawowej tratwy. Powinno być drukowane dość wolno, ponieważ objętość materiału wydobywającego się z dyszy jest dość duża.

# raft_base_speed label
source: Raft Base Print Speed
pl: Prędkość druku do bazy tratwy

# raft_base_thickness description
source: Layer thickness of the base raft layer. This should be a thick layer which sticks firmly to the printer build plate.
pl: Grubość warstwy podstawowej warstwy tratwy. Powinna to być gruba warstwa, która mocno przykleja się do płyty do budowy drukarki.

# raft_base_thickness label
source: Raft Base Thickness
pl: Grubość podstawy tratwy

# raft_fan_speed description
source: The fan speed for the raft.
pl: Prędkość wentylatora dla tratwy.

# raft_fan_speed label
source: Raft Fan Speed
pl: Prędkość wentylatora dla tratwy

# raft_interface_acceleration description
source: The acceleration with which the middle raft layer is printed.
pl: Przyspieszenie, z jaką drukuje się środkową warstwę tratwy.

# raft_interface_acceleration label
source: Raft Middle Print Acceleration
pl: Przyspieszenie drukowania środkowego tratwy

# raft_interface_fan_speed description
source: The fan speed for the middle raft layer.
pl: Prędkość wentylatora dla środkowej warstwy tratwy.

# raft_interface_fan_speed label
source: Raft Middle Fan Speed
pl: Średnia szybkość wentylatora tratwy

# raft_interface_jerk description
source: The jerk with which the middle raft layer is printed.
pl: Funkcja (jerk) z których środkowe warstwy tratwy są drukowane.

# raft_interface_jerk label
source: Raft Middle Print Jerk
pl: Funkcja Print Center Tratwa Jerk

# raft_interface_line_spacing description
source: The distance between the raft lines for the middle raft layer. The spacing of the middle should be quite wide, while being dense enough to support the top raft layers.
pl: Odległość między linami tratującymi dla środkowej warstwy tratwy. Odległość środkowa powinna być dość szeroka, a jednocześnie wystarczająco gęsta, aby podtrzymywać górne warstwy tratwy.

# raft_interface_line_spacing label
source: Raft Middle Spacing
pl: Odległość między środkiem a tratwą

# raft_interface_line_width description
source: Width of the lines in the middle raft layer. Making the second layer extrude more causes the lines to stick to the build plate.
pl: Szerokość linii w środkowej warstwie tratwy. Wytłaczanie drugiej warstwy powoduje, że linie przyklejają się do płyty.

# raft_interface_line_width label
source: Raft Middle Line Width
pl: Szerokość tratwy środkowej

# raft_interface_speed description
source: The speed at which the middle raft layer is printed. This should be printed quite slowly, as the volume of material coming out of the nozzle is quite high.
pl: Prędkość, z jaką drukuje się środkową warstwę tratwy. Powinno być drukowane dość wolno, ponieważ objętość materiału wydobywającego się z dyszy jest dość duża.

# raft_interface_speed label
source: Raft Middle Print Speed
pl: Prędkość druku centrum Tratwa

# raft_interface_thickness description
source: Layer thickness of the middle raft layer.
pl: Grubość warstwy środkowej warstwy tratwy.

# raft_interface_thickness label
source: Raft Middle Thickness
pl: Średnia grubość tratwy

# raft_jerk description
source: The jerk with which the raft is printed.
pl: Funkcja jerk, z którym tratwa zostanie wydrukowany.

# raft_jerk label
source: Raft Print Jerk
pl: Funkcja szarpnięcie (jerk) Tratwa Drukuj

# raft_margin description
source: If the raft is enabled, this is the extra raft area around the model which is also given a raft. Increasing this margin will create a stronger raft while using more material and leaving less area for your print.
pl: Jeśli tratwa jest włączona, jest to dodatkowy obszar tratwy wokół modelu, który ma również tratwę. Zwiększenie marginesu zwiększy tratwę podczas korzystania z większej ilości materiału i pozostawia mniej miejsca na wydruk.

# raft_margin label
source: Raft Extra Margin
pl: Dodatkowa odległość do Tratwy

# raft_speed description
source: The speed at which the raft is printed.
pl: Prędkość, w jakiej tratwa jest drukowana.

# raft_speed label
source: Raft Print Speed
pl: Prędkość druku tratwy

# raft_surface_acceleration description
source: The acceleration with which the top raft layers are printed.
pl: Przyspieszenie, z jaką drukowane są górne warstwy tratwy.

# raft_surface_acceleration label
source: Raft Top Print Acceleration
pl: Przyspieszenie druku górnej wartwy tratwy

# raft_surface_fan_speed description
source: The fan speed for the top raft layers.
pl: Prędkość wentylatora dla górnej warstwy tratwy.

# raft_surface_fan_speed label
source: Raft Top Fan Speed
pl: Szybkość wentylatora górnej warstwy tratwy

# raft_surface_jerk description
source: The jerk with which the top raft layers are printed.
pl: Przyśpieszenie (jerk), z którym są drukowane górne warstwy tratwy.

# raft_surface_jerk label
source: Raft Top Print Jerk
pl: Góra tratwy przyśpieszenie (jerk)

# raft_surface_layers description
source: The number of top layers on top of the 2nd raft layer. These are fully filled layers that the model sits on. 2 layers result in a smoother top surface than 1.
pl: Liczba górnych warstw na górze drugiej warstwy tratwy. Są to w pełni wypełnione warstwy, na których siedzi model. 2 warstwy tworzą gładszą górną powierzchnię niż 1.

# raft_surface_layers label
source: Raft Top Layers
pl: Warstwy górnej tratwy

# raft_surface_line_spacing description
source: The distance between the raft lines for the top raft layers. The spacing should be equal to the line width, so that the surface is solid.
pl: Odległość między tratwami dla górnej warstwy tratwy. Rozstaw powinien być równy szerokości linii, tak że powierzchnia jest stała.

# raft_surface_line_spacing label
source: Raft Top Spacing
pl: Rozstaw górny tratw

# raft_surface_line_width description
source: Width of the lines in the top surface of the raft. These can be thin lines so that the top of the raft becomes smooth.
pl: Szerokość linii w górnej powierzchni tratwy. Mogą to być cienkie linie tak, aby góra tratwy była gładka.

# raft_surface_line_width label
source: Raft Top Line Width
pl: Szerokość linii górnej tratwy

# raft_surface_speed description
source: The speed at which the top raft layers are printed. These should be printed a bit slower, so that the nozzle can slowly smooth out adjacent surface lines.
pl: Prędkość, w jakiej są drukowane górne warstwy tratwy. Powinny być drukowane nieco wolniej, dzięki czemu dysza może powoli wypolerować sąsiednie linie powierzchni.

# raft_surface_speed label
source: Raft Top Print Speed
pl: Górna szybkość druku tratwy

# raft_surface_thickness description
source: Layer thickness of the top raft layers.
pl: Grubość warstwy górnej warstwy tratwy.

# raft_surface_thickness label
source: Raft Top Layer Thickness
pl: Grubość warstwy tratwy

# resolution description
source: All settings that influence the resolution of the print. These settings have a large impact on the quality (and print time)
pl: Wszystkie ustawienia, które wpływają na rozdzielczość druku. Ustawienia te mają ogromny wpływ na jakość kompresji (zmęczenie).

# resolution label
source: Quality
pl: Jakość

# retract_at_layer_change description
source: Retract the filament when the nozzle is moving to the next layer.
pl: Cofnij filament, gdy dysza przesuwa się do następnej warstwy.

# retract_at_layer_change label
source: Retract at Layer Change
pl: Poruszać się ze zmianą warstwy

# retraction_amount description
source: The length of material retracted during a retraction move.
pl: Długość materiału wycofanego podczas przesuwania.

# retraction_amount label
source: Retraction Distance
pl: Długość cofania filamentu

# retraction_combing description
source: Combing keeps the nozzle within already printed areas when traveling. This results in slightly longer travel moves but reduces the need for retractions. If combing is off, the material will retract and the nozzle moves in a straight line to the next point. It is also possible to avoid combing over top/bottom skin areas by combing within the infill only.
pl: Kombinacja utrzymuje dyszę w już zadrukowanych obszarach podczas podróży. Powoduje to nieco dłuższe ruchy podróży, ale zmniejsza potrzebę wycofania. Jeśli czesanie jest wyłączone, materiał się cofa, a dysza przemieszcza się w prostej linii do następnego punktu. Można też unikać czesania górnych / dolnych obszarów skóry przez czesanie wewnątrz wypełnienia.

# retraction_combing label
source: Combing Mode
pl: Tryb łączenia

# retraction_combing option all
source: All
pl: Wszystko

# retraction_combing option noskin
source: No Skin
pl: Bez poszycia zewnętrznego

# retraction_combing option off
source: Off
pl: Poza

# retraction_count_max description
source: This setting limits the number of retractions occurring within the minimum extrusion distance window. Further retractions within this window will be ignored. This avoids retracting repeatedly on the same piece of filament, as that can flatten the filament and cause grinding issues.
pl: To ustawienie ogranicza liczbę wycofań występujących w minimalnym oknie odległości wyciskania. Dalsze wycofania w tym oknie zostaną zignorowane. Pozwala to uniknąć wielokrotnego opuszczania na tym samym kawałku żarnika, ponieważ może spłaszczyć włókno i powodować problemy z wyciskaniem filamentu.

# retraction_count_max label
source: Maximum Retraction Count
pl: Maksymalna liczba wycofania

# retraction_enable description
source: Retract the filament when the nozzle is moving over a non-printed area.
pl: Cofnij włókno, gdy dysza porusza się nad obszarem, w którym nie jest zadrukowany.

# retraction_enable label
source: Enable Retraction
pl: Włącz wycofanie

# retraction_extra_prime_amount description
source: Some material can ooze away during a travel move, which can be compensated for here.
pl: Podczas przemieszczania przez nie obszaru drukowania materiałów mogą wypływać z dala, które mogą być kompensowane tutaj.

# retraction_extra_prime_amount label
source: Retraction Extra Prime Amount
pl: Dodatkowa retrakcja Push-back

# retraction_extrusion_window description
source: The window in which the maximum retraction count is enforced. This value should be approximately the same as the retraction distance, so that effectively the number of times a retraction passes the same patch of material is limited.
pl: Okno, w którym maksymalna liczba wycofania jest wymuszona. Wartość ta powinna być w przybliżeniu taka sama jak odległość wycofania, dzięki czemu skutecznie liczba razy cofnięcie przebiega przez tę samą warstwę materiału jest ograniczona.

# retraction_extrusion_window label
source: Minimum Extrusion Distance Window
pl: Minimalna odległość Okno wytłaczania

# retraction_hop description
source: The height difference when performing a Z Hop.
pl: Różnica w wysokości podczas wykonywania Z-skok.

# retraction_hop label
source: Z Hop Height
pl: Wysokość skoku Z

# retraction_hop_after_extruder_switch description
source: After the machine switched from one extruder to the other, the build plate is lowered to create clearance between the nozzle and the print. This prevents the nozzle from leaving oozed material on the outside of a print.
pl: Po przełączeniu maszyny z jednej wytłaczarki na drugą, płyta konstrukcyjna jest opuszczana, aby utworzyć luz pomiędzy dyszy a drukiem. Zapobiega to wypływaniu dyszy z wypchanego materiału na zewnątrz wydruku.

# retraction_hop_after_extruder_switch label
source: Z Hop After Extruder Switch
pl: Przełącznik wytłaczarki Z skok

# retraction_hop_enabled description
source: Whenever a retraction is done, the build plate is lowered to create clearance between the nozzle and the print. It prevents the nozzle from hitting the print during travel moves, reducing the chance to knock the print from the build plate.
pl: Zawsze, gdy następuje wycofanie, płyta konstrukcyjna jest opuszczana w celu utworzenia luzu między dyszą a drukiem. Zapobiega to uderzeniu dyszy w ruch podczas podróży, co zmniejsza szanse wybicia wydruku z płyty.

# retraction_hop_enabled label
source: Z Hop When Retracted
pl: Z-skok podczas wciągania

# retraction_hop_only_when_collides description
source: Only perform a Z Hop when moving over printed parts which cannot be avoided by horizontal motion by Avoid Printed Parts when Traveling.
pl: Podczas przesuwania się nad drukowanymi częściami, które nie da się uniknąć w ruchu poziomej, wykonaj Z-skok tylko unikając drukowanych części podczas podróży.

# retraction_hop_only_when_collides label
source: Z Hop Only Over Printed Parts
pl: Z-skok tylko nad drukowanymi częściami

# retraction_min_travel description
source: The minimum distance of travel needed for a retraction to happen at all. This helps to get fewer retractions in a small area.
pl: Minimalna odległość podróży potrzebna do wycofania się w ogóle. To pomaga uzyskać mniej retractions w małym obszarze.

# retraction_min_travel label
source: Retraction Minimum Travel
pl: Minimalny przejazd dla retrakcji

# retraction_prime_speed description
source: The speed at which the filament is primed during a retraction move.
pl: Prędkość, przy której dysza jest przesunięta w czasie ruchu cofania.

# retraction_prime_speed label
source: Retraction Prime Speed
pl: Wysoka prędkość wycofania retrakcji

# retraction_retract_speed description
source: The speed at which the filament is retracted during a retraction move.
pl: Prędkość, z jaką włókna są wycofywane podczas ruchu wycofania.

# retraction_retract_speed label
source: Retraction Retract Speed
pl: Prędkość wycofania retrakcji
