Repository: GregValiant/CuraMaster
Catalog: resources/i18n/*/fdmprinter.def.json.po
Languages: pl

# wall_line_width_x description
source: Width of a single wall line for all wall lines except the outermost one.
pl: Szerokość jednej linii dla wszystkich linii ściany z wyjątkiem jednej najbardziej zewnętrznej.

# wall_line_width_x label
source: Inner Wall(s) Line Width
pl: Szerokość linii ścian wewnętrznych

# wall_thickness description
source: The thickness of the outside walls in the horizontal direction. This value divided by the wall line width defines the number of walls.
pl: Grubość ścian zewnętrznych w kierunku poziomym. Ta wartość podzielona przez szerokość linii ściennej określa liczbę ścian.

# wall_thickness label
source: Wall Thickness
pl: Grubość ścianki

# wireframe_bottom_delay description
source: Delay time after a downward move. Only applies to Wire Printing.
pl: Opóźnienie po przejściu w dół. Dotyczy tylko Drukowania drutu.

# wireframe_bottom_delay label
source: WP Bottom Delay
pl: W dół opóźnienia w drukowaniu ze strukturą drucianą

# wireframe_drag_along description
source: Distance with which the material of an upward extrusion is dragged along with the diagonally downward extrusion. This distance is compensated for. Only applies to Wire Printing.
pl: Odległość, z jaką przecina się materiał wytłoczony do góry wraz z wytłoczeniem po przekątnej. Ta odległość jest kompensowana. Dotyczy tylko Drukowania drutu.

# wireframe_drag_along label
source: WP Drag Along
pl: Dokręcić przypadku drukowania ze strukturą drucianą

# wireframe_enabled description
source: Print only the outside surface with a sparse webbed structure, printing 'in thin air'. This is realized by horizontally printing the contours of the model at given Z intervals which are connected via upward and diagonally downward lines.
pl: Wydrukuj tylko zewnętrzną powierzchnię o słabej strukturze tkaniny, drukując "w cienkim powietrzu". Jest to realizowane poprzez poziomy wydruk konturów modelu w określonych przedziałach Z, które są połączone przez linie skierowane w górę iw dół.

# wireframe_enabled label
source: Wire Printing
pl: Drukowanie druków

# wireframe_fall_down description
source: Distance with which the material falls down after an upward extrusion. This distance is compensated for. Only applies to Wire Printing.
pl: Odległość spada materiału przez wytłaczanie w górę. Trasa ta jest kompensowana. Odnosi się tylko do drukowania ze strukturą drucianą.

# wireframe_fall_down label
source: WP Fall Down
pl: Upaść podczas strukturze drutu drukowanie

# wireframe_flat_delay description
source: Delay time between two horizontal segments. Introducing such a delay can cause better adhesion to previous layers at the connection points, while too long delays cause sagging. Only applies to Wire Printing.
pl: Czas opóźnienia dwóch poziomych odcinków. Dzięki takiej zwłoki lepsze przyleganie można uzyskać w punktach połączeń z poprzednich warstwach; przy zbyt dużym opóźnieniem może jednak prowadzić do zatonięcia komponentów. Odnosi się tylko do drukowania ze strukturą drucianą.

# wireframe_flat_delay label
source: WP Flat Delay
pl: Opóźnienie w drukowaniu z poziomej konstrukcji z drutu

# wireframe_flow description
source: Flow compensation: the amount of material extruded is multiplied by this value. Only applies to Wire Printing.
pl: Kompensacja przepływu: Wytłaczany ilość materiału jest mnożone przez tę wartość. Odnosi się tylko do drukowania ze strukturą drucianą.

# wireframe_flow label
source: WP Flow
pl: Płynąć do druku struktury drutu

# wireframe_flow_connection description
source: Flow compensation when going up or down. Only applies to Wire Printing.
pl: Kompensacja przepływu w górę iw dół. Odnosi się tylko do drukowania ze strukturą drucianą.

# wireframe_flow_connection label
source: WP Connection Flow
pl: Płynąć do połączeń Drukowanie za pomocą konstrukcji z drutu

# wireframe_flow_flat description
source: Flow compensation when printing flat lines. Only applies to Wire Printing.
pl: Kompensacja przepływu podczas drukowania płaskich linii. Dotyczy tylko Drukowania drutu.

# wireframe_flow_flat label
source: WP Flat Flow
pl: Przepływ do druku płaskiego linii ze struktury z drutu

# wireframe_height description
source: The height of the upward and diagonally downward lines between two horizontal parts. This determines the overall density of the net structure. Only applies to Wire Printing.
pl: Wysokość w górę i po przekątnej linii między dwiema częściami poziomymi. Określa ona całkowitą gęstość struktury netto. Dotyczy tylko Drukowania drutu.

# wireframe_height label
source: WP Connection Height
pl: Wysokość przyłącza przy drukowaniu o strukturze drucianej

# wireframe_nozzle_clearance description
source: Distance between the nozzle and horizontally downward lines. Larger clearance results in diagonally downward lines with a less steep angle, which in turn results in less upward connections with the next layer. Only applies to Wire Printing.
pl: Odległość między dyszą a liniami skierowanymi w dół. Większe prześwity powodują ukośne skierowanie w dół linii o mniej stromym kącie, co z kolei skutkuje mniejszymi połączeniami z następną warstwą. Dotyczy tylko Drukowania drutu.

# wireframe_nozzle_clearance label
source: WP Nozzle Clearance
pl: Rozdzielacze dysz WP

# wireframe_printspeed description
source: Speed at which the nozzle moves when extruding material. Only applies to Wire Printing.
pl: Prędkość, w której dysze przemieszczają się podczas wytłaczania materiału. Dotyczy tylko Drukowania drutu.

# wireframe_printspeed label
source: WP Speed
pl: Prędkość przy drukowaniu ze strukturą drucianą

# wireframe_printspeed_bottom description
source: Speed of printing the first layer, which is the only layer touching the build platform. Only applies to Wire Printing.
pl: Prędkość drukowania pierwszej warstwy, która jest jedyną warstwą dotykającą platformy build. Dotyczy tylko Drukowania drutu.

# wireframe_printspeed_bottom label
source: WP Bottom Printing Speed
pl: Prędkość druku w dolnej części strony

# wireframe_printspeed_down description
source: Speed of printing a line diagonally downward. Only applies to Wire Printing.
pl: Prędkość przy drukowaniu linii ukośnie ku dołowi. Odnosi się tylko do drukowania ze strukturą drucianą.

# wireframe_printspeed_down label
source: WP Downward Printing Speed
pl: Prędkość podczas drukowania w dół ze strukturą drucianą

# wireframe_printspeed_flat description
source: Speed of printing the horizontal contours of the model. Only applies to Wire Printing.
pl: Prędkość podczas drukowania poziome konturów modelu. Odnosi się tylko do drukowania ze strukturą drucianą.

# wireframe_printspeed_flat label
source: WP Horizontal Printing Speed
pl: Prędkość drukowania poziomego WP

# wireframe_printspeed_up description
source: Speed of printing a line upward 'in thin air'. Only applies to Wire Printing.
pl: Szybkość drukowania linii „pływający” w kierunku do góry. Odnosi się tylko do drukowania ze strukturą drucianą.

# wireframe_printspeed_up label
source: WP Upward Printing Speed
pl: Prędkość podczas drukowania w kierunku do góry ze strukturą drucianą

# wireframe_roof_drag_along description
source: The distance of the end piece of an inward line which gets dragged along when going back to the outer outline of the roof. This distance is compensated for. Only applies to Wire Printing.
pl: Odległość od końcówki rozciągającego się do wewnątrz wokół linii którym jest zaciśnięte na powrót do zewnętrznej linii obwodowej dachu. Trasa ta jest kompensowana. Odnosi się tylko do drukowania ze strukturą drucianą.

# wireframe_roof_drag_along label
source: WP Roof Drag Along
pl: Dokręcić dach podczas drukowania ze strukturą drucianą

# wireframe_roof_fall_down description
source: The distance which horizontal roof lines printed 'in thin air' fall down when being printed. This distance is compensated for. Only applies to Wire Printing.
pl: Odległość, na jaką drukowane są poziome linie dachu "w cienkim powietrzu". Ta odległość jest kompensowana. Dotyczy tylko Drukowania drutu.

# wireframe_roof_fall_down label
source: WP Roof Fall Down
pl: Spada z dachu podczas drukowania ze strukturą drucianą

# wireframe_roof_inset description
source: The distance covered when making a connection from a roof outline inward. Only applies to Wire Printing.
pl: Zadaszony odległość podczas nawiązywania połączenia z konturem dachu do środka. Odnosi się tylko do drukowania ze strukturą drucianą.

# wireframe_roof_inset label
source: WP Roof Inset Distance
pl: Odległość wstawka na dachu przy drukowaniu ze strukturą drucianą

# wireframe_roof_outer_delay description
source: Time spent at the outer perimeters of hole which is to become a roof. Longer times can ensure a better connection. Only applies to Wire Printing.
pl: Czas, który poświęca się na zewnętrznych obrzeżach otworu, który ma stać się dach później. połączenie może być lepiej z dłuższymi czasami. Odnosi się tylko do drukowania ze strukturą drucianą.

# wireframe_roof_outer_delay label
source: WP Roof Outer Delay
pl: Opóźnienia dla obwodów dachowych przy drukowaniu ze strukturą drucianą

# wireframe_straight_before_down description
source: Percentage of a diagonally downward line which is covered by a horizontal line piece. This can prevent sagging of the top most point of upward lines. Only applies to Wire Printing.
pl: Odsetek linii przekątnej w dół, która jest przykryta poziomą linią. Może to uniemożliwić zwielokrotnienie górnej krawędzi w górę. Dotyczy tylko Drukowania drutu.

# wireframe_straight_before_down label
source: WP Straighten Downward Lines
pl: WP Prostuj linie w dół

# wireframe_strategy description
source: Strategy for making sure two consecutive layers connect at each connection point. Retraction lets the upward lines harden in the right position, but may cause filament grinding. A knot can be made at the end of an upward line to heighten the chance of connecting to it and to let the line cool; however, it may require slow printing speeds. Another strategy is to compensate for the sagging of the top of an upward line; however, the lines won't always fall down as predicted.
pl: Strategia zapewniająca podłączenie dwóch kolejnych warstw w każdym punkcie połączenia. Odsunięcie pozwala na utwardzenie w górę pozycji we właściwej pozycji, ale może powodować mielenie filamentów. Sieć węzła może być wykonana na końcu linii do góry, aby zwiększyć szanse na połączenie z nią i pozostawić linię chłodną; Może to jednak wymagać szybkich prędkości druku. Inną strategią jest wyrównanie opadania górnej krawędzi w górę; Jednak linie nie zawsze spadają zgodnie z przewidywaniami.

# wireframe_strategy label
source: WP Strategy
pl: Strategia dla konstrukcji z drutu drukowanie

# wireframe_strategy option compensate
source: Compensate
pl: Kompensować

# wireframe_strategy option knot
source: Knot
pl: Węzeł

# wireframe_strategy option retract
source: Retract
pl: Wycofanie

# wireframe_top_delay description
source: Delay time after an upward move, so that the upward line can harden. Only applies to Wire Printing.
pl: Opóżnienie czasu po wzniesieniu w górę, tak aby linia w górę mogła się zesztywniać. Dotyczy tylko Drukowania drutu.

# wireframe_top_delay label
source: WP Top Delay
pl: Up opóźnienia w drukowaniu ze strukturą drucianą

# wireframe_top_jump description
source: Creates a small knot at the top of an upward line, so that the consecutive horizontal layer has a better chance to connect to it. Only applies to Wire Printing.
pl: Tworzy mały węzeł u góry linii w górę, dzięki czemu kolejna pozioma warstwa ma większą szansę połączenia się z nią. Dotyczy tylko Drukowania drutu.

# wireframe_top_jump label
source: WP Knot Size
pl: Rozmiar węzła do druku struktury drutu

# wireframe_up_half_speed description
source: Distance of an upward move which is extruded with half speed. This can cause better adhesion to previous layers, while not heating the material in those layers too much. Only applies to Wire Printing.
pl: Dystans przemieszczania się ku górze, która jest wytłaczana z połową szybkości. Może to prowadzić do lepszej przyczepności do wcześniejszych warstwach, a przegrzanie materiału unika się w tych warstwach. Odnosi się tylko do drukowania ze strukturą drucianą.

# wireframe_up_half_speed label
source: WP Ease Upward
pl: Przy drukowaniu o strukturze drucianej powolny ruch ku górze

# xy_offset description
source: Amount of offset applied to all polygons in each layer. Positive values can compensate for too big holes; negative values can compensate for too small holes.
pl: Wysokość przesunięcia zastosowana do wszystkich wieloboków w każdej warstwie. Pozytywne wartości mogą kompensować zbyt duże otwory; Wartości ujemne mogą kompensować zbyt małe otwory.

# xy_offset label
source: Horizontal Expansion
pl: Rozszerzenie poziome

# z_seam_type description
source: Starting point of each path in a layer. When paths in consecutive layers start at the same point a vertical seam may show on the print. When aligning these near a user specified location, the seam is easiest to remove. When placed randomly the inaccuracies at the paths' start will be less noticeable. When taking the shortest path the print will be quicker.
pl: Punkt początkowy każdej ścieżki w warstwie. Kiedy ścieżki w kolejnych warstwach zaczynają się w tym samym punkcie, na wydruku może pojawić się pionowy szew. Wyrównywanie ich w pobliżu określonej przez użytkownika lokalizacji powoduje, że szew jest najprostszy do usunięcia. Po umieszczeniu losowo niedokładności na początku ścieżki będzie mniej zauważalny. Podczas najkrótszej drogi wydruk będzie szybszy.

# z_seam_type label
source: Z Seam Alignment
pl: Wyrównanie szwu Z

# z_seam_type option back
source: User Specified
pl: Użytkownik został określony

# z_seam_type option random
source: Random
pl: Losowa

# z_seam_type option shortest
source: Shortest
pl: Najkrótsza

# z_seam_x description
source: The X coordinate of the position near where to start printing each part in a layer.
pl: Współrzędna X położenia, w pobliżu miejsca rozpoczęcia drukowania każdej części w warstwie.

# z_seam_x label
source: Z Seam X
pl: Z-X szew

# z_seam_y description
source: The Y coordinate of the position near where to start printing each part in a layer.
pl: Współrzędna Y położenia, w pobliżu miejsca rozpoczęcia drukowania każdej części w warstwie.

# z_seam_y label
source: Z Seam Y
pl: Z-Y szew
