Repository: GregValiant/CuraMaster
Catalog: resources/i18n/*/fdmprinter.def.json.po
Languages: pl

# support_conical_enabled label
source: Enable Conical Support
pl: Włącz wsparcie stożkowe

# support_conical_min_width description
source: Minimum width to which the base of the conical support area is reduced. Small widths can lead to unstable support structures.
pl: Minimalna szerokość, na którą jest zmniejszona podstawa stożkowego podparcia. Małe szerokości mogą prowadzić do niestabilnych struktur nośnych

# support_conical_min_width label
source: Conical Support Minimum Width
pl: Wspornik stożkowy Minimalna szerokość

# support_connect_zigzags description
source: Connect the ZigZags. This will increase the strength of the zig zag support structure.
pl: Elementy zygzaka są połączone. To zwiększa wytrzymałość zygzakowatej konstrukcji nośnej.

# support_connect_zigzags label
source: Connect Support ZigZags
pl: Zygzakowate łączenia elementów wspierających konstrukcję

# support_enable description
source: Generate structures to support parts of the model which have overhangs. Without these structures, such parts would collapse during printing.
pl: Generowanie struktur wspierających części modelu, które mają zwis. Bez tych struktur takie części mogłyby spaść podczas drukowania.

# support_enable label
source: Generate Support
pl: Wygeneruj podpory

# support_extruder_nr description
source: The extruder train to use for printing the support. This is used in multi-extrusion.
pl: Element wytłaczarki do drukowania na konstrukcji nośnej. Służy do multi-ekstruzji.

# support_extruder_nr label
source: Support Extruder
pl: Konstrukcja nośna wytłaczarki

# support_extruder_nr_layer_0 description
source: The extruder train to use for printing the first layer of support infill. This is used in multi-extrusion.
pl: Wytłaczarka wykorzystuje do drukowania pierwszej warstwy wypełnienia podłoża. Jest on stosowany w wielu wytłaczaniach.

# support_extruder_nr_layer_0 label
source: First Layer Support Extruder
pl: Pierwsza warstwa wspierająca wytłaczarkę

# support_infill_extruder_nr description
source: The extruder train to use for printing the infill of the support. This is used in multi-extrusion.
pl: Element wytłaczarki do drukowania napełnianie konstrukcji nośnej. Służy do multi-ekstruzji.

# support_infill_extruder_nr label
source: Support Infill Extruder
pl: Wytłaczarka do wypełniania strukturę nośną

# support_infill_rate description
source: Adjusts the density of the support structure. A higher value results in better overhangs, but the supports are harder to remove.
pl: Reguluje gęstość konstrukcji wsporczej. Wyższa wartość powoduje lepsze zwisy, ale podpory są trudniejsze do usunięcia.

# support_infill_rate label
source: Support Density
pl: Gęstość konstrukcji nośnej

# support_interface_density description
source: Adjusts the density of the roofs and floors of the support structure. A higher value results in better overhangs, but the supports are harder to remove.
pl: Dostosowuje gęstość dachów i podłóg konstrukcji nośnej. Wyższa wartość powoduje lepsze zwisy, ale podpory są trudniejsze do usunięcia.

# support_interface_density label
source: Support Interface Density
pl: Gęstość interfejsu pomocniczego

# support_interface_enable description
source: Generate a dense interface between the model and the support. This will create a skin at the top of the support on which the model is printed and at the bottom of the support, where it rests on the model.
pl: Generuje szczelne połączenie pomiędzy modelem i konstrukcją nośną. To tworzy skóry na górnej części konstrukcji nośnej, na której model jest drukowany i spód konstrukcji nośnej, gdzie opiera się na modelu.

# support_interface_enable label
source: Enable Support Interface
pl: Włącz interfejs wsparcia

# support_interface_extruder_nr description
source: The extruder train to use for printing the roofs and floors of the support. This is used in multi-extrusion.
pl: Element wytłaczarki do drukowania na dachy i podłogi konstrukcji nośnej. Służy do multi-ekstruzji.

# support_interface_extruder_nr label
source: Support Interface Extruder
pl: Wytłaczarka interfejsu wspomagającego

# support_interface_height description
source: The thickness of the interface of the support where it touches with the model on the bottom or the top.
pl: Grubość styku konstrukcji nośnej, gdzie styka się ona Model powyżej i poniżej.

# support_interface_height label
source: Support Interface Thickness
pl: Grubość interfejsu konstrukcja wsporcza

# support_interface_line_width description
source: Width of a single line of support roof or floor.
pl: Szerokość pojedynczej linii podparcia dachu lub podłogi.

# support_interface_line_width label
source: Support Interface Line Width
pl: Szerokość linii interfejsu podpór

# support_interface_pattern description
source: The pattern with which the interface of the support with the model is printed.
pl: Wzorzec, z którym drukowany jest interfejs nośnika z modelem.

# support_interface_pattern label
source: Support Interface Pattern
pl: Wzór interfejs konstrukcja nośna

# support_interface_pattern option concentric
source: Concentric
pl: Koncentryczny

# support_interface_pattern option concentric_3d
source: Concentric 3D
pl: Koncentryczny 3D

# support_interface_pattern option grid
source: Grid
pl: Kratka

# support_interface_pattern option lines
source: Lines
pl: Liniowy

# support_interface_pattern option triangles
source: Triangles
pl: Trójkąty

# support_interface_pattern option zigzag
source: Zig Zag
pl: Zygzak

# support_interface_skip_height description
source: When checking where there's model above and below the support, take steps of the given height. Lower values will slice slower, while higher values may cause normal support to be printed in some places where there should have been support interface.
pl: Sprawdzając, gdzie znajduje się model powyżej i poniżej wspornika, wykonaj kroki na danej wysokości. Niższe wartości będą łamywać wolniej, podczas gdy wyższe wartości mogą powodować drukowanie zwykłego nośnika w niektórych miejscach, w których powinien istnieć interfejs obsługi.

# support_interface_skip_height label
source: Support Interface Resolution
pl: Rozdzielczość interfejs konstrukcja nośna

# support_join_distance description
source: The maximum distance between support structures in the X/Y directions. When seperate structures are closer together than this value, the structures merge into one.
pl: Maksymalna odległość między konstrukcjami nośnymi w kierunkach X / Y. Gdy oddzielne struktury są bliżej siebie niż ta wartość, struktury łączą się w jedną.

# support_join_distance label
source: Support Join Distance
pl: Odległość do łączenia struktur wsparcia

# support_line_distance description
source: Distance between the printed support structure lines. This setting is calculated by the support density.
pl: Odległość między drukowanymi liniami nośnymi. To ustawienie jest obliczane przez gęstość nośną.

# support_line_distance label
source: Support Line Distance
pl: Odstępy między wierszami konstrukcji nośnej

# support_line_width description
source: Width of a single support structure line.
pl: Szerokość jednej linii konstrukcji nośnej.

# support_line_width label
source: Support Line Width
pl: Szerokość linii podpór

# support_mesh description
source: Use this mesh to specify support areas. This can be used to generate support structure.
pl: Użyj tej siatki, aby określić obszary wsparcia. Można to wykorzystać do generowania struktury nośnej.

# support_mesh label
source: Support Mesh
pl: Wsparcie siatki

# support_mesh_drop_down description
source: Make support everywhere below the support mesh, so that there's no overhang in the support mesh.
pl: Wspieraj wszędzie pod siatką podpory, tak aby nie było zwisu w siatce podpory.

# support_mesh_drop_down label
source: Drop Down Support Mesh
pl: Siatka wsparcia Drop Down

# support_minimal_diameter description
source: Minimum diameter in the X/Y directions of a small area which is to be supported by a specialized support tower.
pl: Minimalna średnica w X / Y kierunkach o małej powierzchni, który jest obsługiwany przez specjalne podpory nośne.

# support_minimal_diameter label
source: Minimum Diameter
pl: Minimalna średnica

# support_offset description
source: Amount of offset applied to all support polygons in each layer. Positive values can smooth out the support areas and result in more sturdy support.
pl: Odstęp, który jest stosowany do wielokątów w poszczególnych warstwach. Wartości dodatnie mogą wygładzić elementy nośne, a tym samym zapewnić bardziej stabilną konstrukcję nośną.

# support_offset label
source: Support Horizontal Expansion
pl: Ekspansja pozioma konstrukcji nośnej

# support_pattern description
source: The pattern of the support structures of the print. The different options available result in sturdy or easy to remove support.
pl: Wzór struktury nośnej druku. Różne opcje zapewniają trwałe lub łatwe do demontażu podparcie.

# support_pattern label
source: Support Pattern
pl: Wzorzec wsparcia/podpory

# support_pattern option concentric
source: Concentric
pl: Koncentryczny

# support_pattern option concentric_3d
source: Concentric 3D
pl: Koncentryczny 3D

# support_pattern option grid
source: Grid
pl: Kratka

# support_pattern option lines
source: Lines
pl: Liniowy

# support_pattern option triangles
source: Triangles
pl: Trójkąty

# support_pattern option zigzag
source: Zig Zag
pl: Zygzak

# support_roof_density description
source: The density of the roofs of the support structure. A higher value results in better overhangs, but the supports are harder to remove.
pl: Gęstość dachów konstrukcji nośnej. Wyższa wartość powoduje lepsze zwisy, ale podpory są trudniejsze do usunięcia.

# support_roof_density label
source: Support Roof Density
pl: Wspieraj gęstość dachu

# support_roof_enable description
source: Generate a dense slab of material between the top of support and the model. This will create a skin between the model and support.
pl: Wytworzyć gęstą płytę materiału pomiędzy wierzchołkiem podparcia a modelem. Powoduje to powstanie skóry między modelem a wsparciem.

# support_roof_enable label
source: Enable Support Roof
pl: Włącz podpory nośne dachu/zwisu

# support_roof_extruder_nr description
source: The extruder train to use for printing the roofs of the support. This is used in multi-extrusion.
pl: Element wytłaczarki do drukowania na konstrukcji wsporczej dachu. Służy do multi-ekstruzji.

# support_roof_extruder_nr label
source: Support Roof Extruder
pl: Wspomaganie ekstruzji dachowej

# support_roof_height description
source: The thickness of the support roofs. This controls the amount of dense layers at the top of the support on which the model rests.
pl: Grubość dachu nośnej. Steruje ilość gęstej warstwy na górnej części konstrukcji nośnej, w którym model jest w pozycji siedzącej.

# support_roof_height label
source: Support Roof Thickness
pl: Grubość warstwy nośnej dachu/zwisu

# support_roof_line_distance description
source: Distance between the printed support roof lines. This setting is calculated by the Support Roof Density, but can be adjusted separately.
pl: Odległość pomiędzy drukowanych linii nośnych dachu. Regulacja ta jest obliczona na podstawie gęstości struktury nośnej, ale może być także ustawiony oddzielnie.

# support_roof_line_distance label
source: Support Roof Line Distance
pl: Wsparcie dla linii dachowej

# support_roof_line_width description
source: Width of a single support roof line.
pl: Szerokość pojedynczej podpory dachowej.

# support_roof_line_width label
source: Support Roof Line Width
pl: Podpory szerokości linii dachu

# support_roof_pattern description
source: The pattern with which the roofs of the support are printed.
pl: Wzór, na którym są drukowane nad dachami podpory.

# support_roof_pattern label
source: Support Roof Pattern
pl: Wsparcie Wzoru Dachu

# support_roof_pattern option concentric
source: Concentric
pl: Koncentryczny

# support_roof_pattern option concentric_3d
source: Concentric 3D
pl: Koncentryczny 3D

# support_roof_pattern option grid
source: Grid
pl: Kratka

# support_roof_pattern option lines
source: Lines
pl: Liniowy

# support_roof_pattern option triangles
source: Triangles
pl: Trójkąty

# support_roof_pattern option zigzag
source: Zig Zag
pl: Zygzak

# support_top_distance description
source: Distance from the top of the support to the print.
pl: Odległość od wierzchołka podpory do nadruku.

# support_top_distance label
source: Support Top Distance
pl: Górny rozstaw struktury wsparcia

# support_tower_diameter description
source: The diameter of a special tower.
pl: Średnica specjalnych filarów.

# support_tower_diameter label
source: Tower Diameter
pl: Średnica filarów

# support_tower_roof_angle description
source: The angle of a rooftop of a tower. A higher value results in pointed tower roofs, a lower value results in flattened tower roofs.
pl: Kąt dachu filar. Wyższa wartość wskazał dachy filar spowodować, niższą wartość spowoduje płytszych dachów filaru.

# support_tower_roof_angle label
source: Tower Roof Angle
pl: Kąt filarów dachowych

# support_type description
source: Adjusts the placement of the support structures. The placement can be set to touching build plate or everywhere. When set to everywhere the support structures will also be printed on the model.
pl: Reguluje rozmieszczenie struktur nośnych. Umiejscowienie można ustawić tak, aby dotykać płyty budowlanej lub wszędzie. Po ustawieniu na wszędzie struktury wydruku będą również drukowane na modelu.

# support_type label
source: Support Placement
pl: Miejsce wsparcia

# support_type option buildplate
source: Touching Buildplate
pl: Dotykając stołu

# support_type option everywhere
source: Everywhere
pl: Wszędzie

# support_use_towers description
source: Use specialized towers to support tiny overhang areas. These towers have a larger diameter than the region they support. Near the overhang the towers' diameter decreases, forming a roof.
pl: Stosowane specjalne słupy wspierajace małe zwisy. Te filary mają średnicę większą niż obsługiwanym z nich obszaru. W pobliżu występu, średnica kolumn, w wyniku powstawania dachu zmniejszyć.

# support_use_towers label
source: Use Towers
pl: Korzystanie z filarów

# support_xy_distance description
source: Distance of the support structure from the print in the X/Y directions.
pl: Odległość konstrukcji nośnej od nadruku w kierunkach X / Y.

# support_xy_distance label
source: Support X/Y Distance
pl: X / Y odległości od konstrukcji wsporczej

# support_xy_distance_overhang description
source: Distance of the support structure from the overhang in the X/Y directions.
pl: Odległość konstrukcji nośnej od zwisu w kierunkach X / Y.

# support_xy_distance_overhang label
source: Minimum Support X/Y Distance
pl: Minimalna odległość X / Y wsparcia

# support_xy_overrides_z description
source: Whether the Support X/Y Distance overrides the Support Z Distance or vice versa. When X/Y overrides Z the X/Y distance can push away the support from the model, influencing the actual Z distance to the overhang. We can disable this by not applying the X/Y distance around overhangs.
pl: Niezależnie od tego, czy odległość X / Y wspornika zastępuje dystans Złącza Wsparcia lub odwrotnie. Kiedy X / Y zignoruje Z, odległość X / Y może odepchnąć podparcie od modelu, wpływając na rzeczywistą odległość Z do zwisu. Możemy to wyłączyć, nie stosując odległości X / Y wokół zwisów.

# support_xy_overrides_z label
source: Support Distance Priority
pl: Priorytet dystansu wsparcia

# support_xy_overrides_z option xy_overrides_z
source: X/Y overrides Z
pl: X / Y zastępuje Z

# support_xy_overrides_z option z_overrides_xy
source: Z overrides X/Y
pl: Z zastępuje X / Y

# support_z_distance description
source: Distance from the top/bottom of the support structure to the print. This gap provides clearance to remove the supports after the model is printed. This value is rounded up to a multiple of the layer height.
pl: Odległość od góry / dołu struktury nośnej do nadruku. Ta luka zapewnia luz, aby usunąć wsporniki po wydrukowaniu modelu. Ta wartość jest zaokrąglana do wielokrotności wysokości warstwy.

# support_z_distance label
source: Support Z Distance
pl: Odległości osi Z od konstrukcji wsporczej

# switch_extruder_prime_speed description
source: The speed at which the filament is pushed back after a nozzle switch retraction.
pl: Prędkość, w której włókno jest odepchniente po wycofaniu przełącznika dyszy.

# switch_extruder_prime_speed label
source: Nozzle Switch Prime Speed
pl: Szybkość podawania przełącznik dyszy (wciągania)

# switch_extruder_retraction_amount description
source: The amount of retraction: Set at 0 for no retraction at all. This should generally be the same as the length of the heat zone.
pl: Ilość wycofania: Ustaw na 0, aby nie wycofać się. To powinno generalnie być takie samo jak długość strefy grzewczej.

# switch_extruder_retraction_amount label
source: Nozzle Switch Retraction Distance
pl: Odległość odsunięcia przełącznika dyszy

# switch_extruder_retraction_speed description
source: The speed at which the filament is retracted during a nozzle switch retract.
pl: Prędkość, z jaką włókna są wycofywane podczas wysuwu przełącznika dyszy.

# switch_extruder_retraction_speed label
source: Nozzle Switch Retract Speed
pl: Szybkość wycofywania przełącznika dyszy

# switch_extruder_retraction_speeds description
source: The speed at which the filament is retracted. A higher retraction speed works better, but a very high retraction speed can lead to filament grinding.
pl: Prędkość, z jaką włókna są wycofywane. Wyższa szybkość wysuwania działa lepiej, ale bardzo duża szybkość wycofywania może prowadzić do złych efektów.

# switch_extruder_retraction_speeds label
source: Nozzle Switch Retraction Speed
pl: Prędkość wycofania przełącznika dyszy

# top_bottom_pattern description
source: The pattern of the top/bottom layers.
pl: Wzór górnej / dolnej warstwy.

# top_bottom_pattern label
source: Top/Bottom Pattern
pl: Dolny/Górny Wzór

# top_bottom_pattern option concentric
source: Concentric
pl: Koncentryczny

# top_bottom_pattern option lines
source: Lines
pl: Liniowy

# top_bottom_pattern option zigzag
source: Zig Zag
pl: Zygzak

# top_bottom_pattern_0 description
source: The pattern on the bottom of the print on the first layer.
pl: Wzorzec na dole wydruku na pierwszej warstwie.

# top_bottom_pattern_0 label
source: Bottom Pattern Initial Layer
pl: Dolna warstwa początkowa

# top_bottom_pattern_0 option concentric
source: Concentric
pl: Koncentryczny

# top_bottom_pattern_0 option lines
source: Lines
pl: Liniowy

# top_bottom_pattern_0 option zigzag
source: Zig Zag
pl: Zygzak

# top_bottom_thickness description
source: The thickness of the top/bottom layers in the print. This value divided by the layer height defines the number of top/bottom layers.
pl: Grubość górnej / dolnej warstwy druku. Ta wartość podzielona przez wysokość warstwy definiuje liczbę warstw wierzchnich / dolnych.

# top_bottom_thickness label
source: Top/Bottom Thickness
pl: Grubość górnej i dolnej

# top_layers description
source: The number of top layers. When calculated by the top thickness, this value is rounded to a whole number.
pl: Liczba górnych warstw. Przy obliczaniu górnej grubości wartość ta jest zaokrąglana do liczby całkowitej

# top_layers label
source: Top Layers
pl: Górne warstwy

# top_thickness description
source: The thickness of the top layers in the print. This value divided by the layer height defines the number of top layers.
pl: Grubość górnych warstw w druku. Ta wartość podzielona przez wysokość warstwy definiuje liczbę warstw górnych.

# top_thickness label
source: Top Thickness
pl: Górna Grubość

# travel description
source: travel
pl: Ruch

# travel label
source: Travel
pl: Podróżować

# travel_avoid_distance description
source: The distance between the nozzle and already printed parts when avoiding during travel moves.
pl: Odległość między dyszą a już drukowanych elementów, gdy są one pominięte w ruchu.

# travel_avoid_distance label
source: Travel Avoid Distance
pl: Podróże Unikaj Odległość

# travel_avoid_other_parts description
source: The nozzle avoids already printed parts when traveling. This option is only available when combing is enabled.
pl: Dysza unika już podczas drukowania drukowanych części. Ta opcja jest dostępna tylko w przypadku włączenia uników dyszy.

# travel_avoid_other_parts label
source: Avoid Printed Parts When Traveling
pl: Unikaj drukowanych części podczas podróży

# travel_compensate_overlapping_walls_0_enabled description
source: Compensate the flow for parts of an outer wall being printed where there is already a wall in place.
pl: Kompensuje przepływ części ścian zewnętrznych, które są drukowane, gdy jest już na miejscu.

# travel_compensate_overlapping_walls_0_enabled label
source: Compensate Outer Wall Overlaps
pl: Kompensuj zewnętrzne zakładki ścienne

# travel_compensate_overlapping_walls_enabled description
source: Compensate the flow for parts of a wall being printed where there is already a wall in place.
pl: Kompensuj przepływ części drukowanej ścianki, w której znajduje się już ściana.

# travel_compensate_overlapping_walls_enabled label
source: Compensate Wall Overlaps
pl: Kompensacyjne nakładki na ściany

# travel_compensate_overlapping_walls_x_enabled description
source: Compensate the flow for parts of an inner wall being printed where there is already a wall in place.
pl: Kompensuje przepływ części wewnętrznej ściany drukowanej, gdy jest już na miejscu.

# travel_compensate_overlapping_walls_x_enabled label
source: Compensate Inner Wall Overlaps
pl: Kompensuj wewnętrzne zakładki

# travel_retract_before_outer_wall description
source: Always retract when moving to start an outer wall.
pl: Zawsze cofaj się podczas ruszania, aby rozpocząć zewnętrzną ścianę.

# travel_retract_before_outer_wall label
source: Retract Before Outer Wall
pl: Cofnij przed ścianą zewnętrzną

# wall_0_inset description
source: Inset applied to the path of the outer wall. If the outer wall is smaller than the nozzle, and printed after the inner walls, use this offset to get the hole in the nozzle to overlap with the inner walls instead of the outside of the model.
pl: Wkład nałożony na ścieżkę zewnętrznej ściany. Jeśli zewnętrzna ścianka jest mniejsza niż dysza i nadrukowana po wewnętrznych ściankach, użyj tego przesunięcia, aby uzyskać otwór w dyszy zachodzić na siebie na wewnętrzne ściany zamiast na zewnątrz modelu.

# wall_0_inset label
source: Outer Wall Inset
pl: Zewnętrzna osłona ścienna

# wall_0_wipe_dist description
source: Distance of a travel move inserted after the outer wall, to hide the Z seam better.
pl: Usunięcie ruchu ściany zewnętrznej, w celu ukrycia Z-szew lepiej.

# wall_0_wipe_dist label
source: Outer Wall Wipe Distance
pl: Odległość od ściany zewnętrznej

# wall_line_count description
source: The number of walls. When calculated by the wall thickness, this value is rounded to a whole number.
pl: Liczba ścian. Przy obliczaniu grubości ścianki ta wartość jest zaokrąglana do liczby całkowitej.

# wall_line_count label
source: Wall Line Count
pl: Liczba linii ściany

# wall_line_width description
source: Width of a single wall line.
pl: Szerokość jednej linii ściany.

# wall_line_width label
source: Wall Line Width
pl: Szerokość linii ściennych

# wall_line_width_0 description
source: Width of the outermost wall line. By lowering this value, higher levels of detail can be printed.
pl: Szerokość linii najbliższa zewnętrznej ścianie. Przez obniżenie tej wartości wyższe poziomy szczegółów mogą być drukowane.

# wall_line_width_0 label
source: Outer Wall Line Width
pl: Szerokość linii ścian zewnętrznych
