Repository: GregValiant/CuraMaster
Catalog: resources/i18n/*/fdmprinter.def.json.po
Languages: pl

# machine_heat_zone_length label
source: Heat zone length
pl: Długość strefy cieplnej

# machine_heated_bed description
source: Whether the machine has a heated build plate present.
pl: Czy maszyna ma podgrzewany stół?

# machine_heated_bed label
source: Has heated build plate
pl: Posiada grzany stół

# machine_height description
source: The height (Z-direction) of the printable area.
pl: Wysokość (w kierunku Z) obszaru drukowania.

# machine_height label
source: Machine height
pl: Wysokość drukarki

# machine_max_acceleration_e description
source: Maximum acceleration for the motor of the filament.
pl: Maksymalne przyspieszenie dla silnika filamentu.

# machine_max_acceleration_e label
source: Maximum Filament Acceleration
pl: Maksymalna przyspieszenie filamentu

# machine_max_acceleration_x description
source: Maximum acceleration for the motor of the X-direction
pl: Maksymalne przyspieszenie dla silnika w kierunku X.

# machine_max_acceleration_x label
source: Maximum Acceleration X
pl: Maksymalne przyspieszenie X

# machine_max_acceleration_y description
source: Maximum acceleration for the motor of the Y-direction.
pl: Maksymalne przyspieszenie dla silnika w kierunku Y.

# machine_max_acceleration_y label
source: Maximum Acceleration Y
pl: Maksymalne przyspieszenie Y

# machine_max_acceleration_z description
source: Maximum acceleration for the motor of the Z-direction.
pl: Maksymalne przyspieszenie dla silnika w kierunku Z.

# machine_max_acceleration_z label
source: Maximum Acceleration Z
pl: maksymalnie przyspieszenie Z

# machine_max_feedrate_e description
source: The maximum speed of the filament.
pl: Maksymalna prędkość włókna.

# machine_max_feedrate_e label
source: Maximum Feedrate
pl: Maksymalny posuw

# machine_max_feedrate_x description
source: The maximum speed for the motor of the X-direction.
pl: Maksymalna prędkość silnika w kierunku X.

# machine_max_feedrate_x label
source: Maximum Speed X
pl: Maksymalna prędkość X

# machine_max_feedrate_y description
source: The maximum speed for the motor of the Y-direction.
pl: Maksymalna prędkość silnika w kierunku Y.

# machine_max_feedrate_y label
source: Maximum Speed Y
pl: Maksymalna prędkość Y

# machine_max_feedrate_z description
source: The maximum speed for the motor of the Z-direction.
pl: Maksymalna prędkość silnika w kierunku Z.

# machine_max_feedrate_z label
source: Maximum Speed Z
pl: Maksymalna prędkość Z

# machine_max_jerk_e description
source: Default jerk for the motor of the filament.
pl: Domyślny szarpnięcie dla silnika filamentu.

# machine_max_jerk_e label
source: Default Filament Jerk
pl: Domyślny Jerk Filamentu

# machine_max_jerk_xy description
source: Default jerk for movement in the horizontal plane.
pl: Domyślny szarpnięcie za ruch w płaszczyźnie poziomej.

# machine_max_jerk_xy label
source: Default X-Y Jerk
pl: Domyślna X-Y Jerk

# machine_max_jerk_z description
source: Default jerk for the motor of the Z-direction.
pl: Domyślny szarpnięcie do silnika w kierunku Z.

# machine_max_jerk_z label
source: Default Z Jerk
pl: Domyślny Z Jerk

# machine_min_cool_heat_time_window description
source: The minimal time an extruder has to be inactive before the nozzle is cooled. Only when an extruder is not used for longer than this time will it be allowed to cool down to the standby temperature.
pl: Minimalny czas wytłaczarki musi być nieaktywny przed ochłodzeniem dyszy. Dopiero, gdy wytłaczarka nie zostanie użyta dłużej niż w tym czasie pozostanie ona ochłodzona do temperatury wstrzymania.

# machine_min_cool_heat_time_window label
source: Minimal Time Standby Temperature
pl: Minimalna temperatura czuwania w trybie gotowości

# machine_minimum_feedrate description
source: The minimal movement speed of the print head.
pl: Minimalna prędkość ruchu głowicy drukującej.

# machine_minimum_feedrate label
source: Minimum Feedrate
pl: Minimalna prędkość posuwu

# machine_name description
source: The name of your 3D printer model.
pl: Nazwa Twojego modelu drukarki 3D.

# machine_name label
source: Machine Type
pl: Typ drukarki

# machine_nozzle_cool_down_speed description
source: The speed (°C/s) by which the nozzle cools down averaged over the window of normal printing temperatures and the standby temperature.
pl: Szybkość (° C / s.), Z którym dysza chłodzi średnio przy normalnym ciśnieniu i temperaturach jest w stanie gotowości.

# machine_nozzle_cool_down_speed label
source: Cool down speed
pl: Prędkość chłodzenia

# machine_nozzle_expansion_angle description
source: The angle between the horizontal plane and the conical part right above the tip of the nozzle.
pl: Kąt pomiędzy poziomą powierzchnią i częścią stożkową bezpośrednio powyżej dyszy.

# machine_nozzle_expansion_angle label
source: Nozzle angle
pl: Kąt dyszy

# machine_nozzle_head_distance description
source: The height difference between the tip of the nozzle and the lowest part of the print head.
pl: Różnica w wysokości pomiędzy końcówki dyszy i najniższej części głowicy drukującej.

# machine_nozzle_head_distance label
source: Nozzle length
pl: Długość dysz

# machine_nozzle_heat_up_speed description
source: The speed (°C/s) by which the nozzle heats up averaged over the window of normal printing temperatures and the standby temperature.
pl: Szybkość (° C / s.), Z którym dysza ogrzewa średnio przy normalnym ciśnieniu i temperaturach jest w stanie gotowości.

# machine_nozzle_heat_up_speed label
source: Heat up speed
pl: Prędkość nagrzewania

# machine_nozzle_size description
source: The inner diameter of the nozzle. Change this setting when using a non-standard nozzle size.
pl: Wewnętrzna średnica dyszy. Użyj tego ustawienia, jeśli używasz dyszę o niestandardowym rozmiarze.

# machine_nozzle_size label
source: Nozzle Diameter
pl: Średnica dyszy

# machine_nozzle_temp_enabled description
source: Whether to control temperature from Cura. Turn this off to control nozzle temperature from outside of Cura.
pl: Do kontroli temperatury Cura. Wyłączyć tę funkcję, aby kontrolować temperaturę dyszy poza Cura.

# machine_nozzle_temp_enabled label
source: Enable Nozzle Temperature Control
pl: Umożliwi kontrolę temperatury dyszy

# machine_nozzle_tip_outer_diameter description
source: The outer diameter of the tip of the nozzle.
pl: Zewnętrzna średnica dyszy.

# machine_nozzle_tip_outer_diameter label
source: Outer nozzle diameter
pl: Średnica dyszy zewnętrznej

# machine_settings description
source: Machine specific settings
pl: Ustawienia specyficzne dla urządzenia

# machine_settings label
source: Machine
pl: Drukarka

# machine_shape description
source: The shape of the build plate without taking unprintable areas into account.
pl: Kształt stołu bez uwzględniania obszarów nieprzedstawnych/klamry itp.

# machine_shape label
source: Build plate shape
pl: Wymiary stołu

# machine_shape option elliptic
source: Elliptic
pl: Eliptyczny

# machine_shape option rectangular
source: Rectangular
pl: Prostokątny

# machine_show_variants description
source: Whether to show the different variants of this machine, which are described in separate json files.
pl: Opcjonalnie wyświetlane są różne wersje tego urządzenia, które są opisane w oddzielnych plikach JSON.

# machine_show_variants label
source: Show machine variants
pl: Pokaż warianty drukarki

# machine_start_gcode description
source: Gcode commands to be executed at the very start - separated by .
pl: Polecenia Gkod są wykonywane od samego początku - oddzielone .

# machine_start_gcode label
source: Start GCode
pl: Rozpocznij G-kod

# machine_use_extruder_offset_to_offset_coords description
source: Apply the extruder offset to the coordinate system.
pl: Zastosuj głowicę drukującą do przesunięcia układu współrzędnych.

# machine_use_extruder_offset_to_offset_coords label
source: Offset With Extruder
pl: Przesunięcie głowicy drukującej

# machine_width description
source: The width (X-direction) of the printable area.
pl: Szerokość (w kierunku X) obszaru drukowania.

# machine_width label
source: Machine width
pl: Szerokość drukarki

# magic_fuzzy_skin_enabled description
source: Randomly jitter while printing the outer wall, so that the surface has a rough and fuzzy look.
pl: Losowo jitter podczas drukowania zewnętrznej ściany, tak że powierzchnia ma szorstki i rozmyty wygląd.

# magic_fuzzy_skin_enabled label
source: Fuzzy Skin
pl: Nierówna skóra

# magic_fuzzy_skin_point_density description
source: The average density of points introduced on each polygon in a layer. Note that the original points of the polygon are discarded, so a low density results in a reduction of the resolution.
pl: Średnia gęstość punktów wprowadzonych na każdy wielokąt w warstwie. Zauważ, że oryginalne punkty wielokąta są odrzucane, a więc niska gęstość powoduje zmniejszenie rozdzielczości.

# magic_fuzzy_skin_point_density label
source: Fuzzy Skin Density
pl: Gęstość nierównej skóry

# magic_fuzzy_skin_point_dist description
source: The average distance between the random points introduced on each line segment. Note that the original points of the polygon are discarded, so a high smoothness results in a reduction of the resolution. This value must be higher than half the Fuzzy Skin Thickness.
pl: Średnia odległość między punktami losowymi wprowadzonymi w każdym segmencie linii. Zwróć uwagę, że oryginalne punkty wielokąta są odrzucane, a zatem duża gładkość powoduje zmniejszenie rozdzielczości. Wartość ta musi być większa niż połowa rozmytej grubości skóry.

# magic_fuzzy_skin_point_dist label
source: Fuzzy Skin Point Distance
pl: Plamki nierównej skóry

# magic_fuzzy_skin_thickness description
source: The width within which to jitter. It's advised to keep this below the outer wall width, since the inner walls are unaltered.
pl: Szerokość, w której ma się drgać. Zaleca się zachować ją poniżej zewnętrznej szerokości ścianki, ponieważ wewnętrzne ściany nie uległy zmianie.

# magic_fuzzy_skin_thickness label
source: Fuzzy Skin Thickness
pl: Grubość skóry niejednorodnego

# magic_mesh_surface_mode description
source: Treat the model as a surface only, a volume, or volumes with loose surfaces. The normal print mode only prints enclosed volumes. "Surface" prints a single wall tracing the mesh surface with no infill and no top/bottom skin. "Both" prints enclosed volumes like normal and any remaining polygons as surfaces.
pl: Traktuj model jako tylko powierzchnię, objętość lub objętość z luźnymi powierzchniami. Zwykły tryb drukowania drukuje tylko zamknięte wolumeny. "Powierzchnia" drukuje pojedynczą ścianę śledzącą powierzchnię siatki bez wypełnienia, a nie górna / dolna skóra. "Oba" drukuje zamknięte tomy takie jak zwykłe i wszelkie pozostałe wielokąty jako powierzchnie.

# magic_mesh_surface_mode label
source: Surface Mode
pl: Tryb powierzchni

# magic_mesh_surface_mode option both
source: Both
pl: Obie

# magic_mesh_surface_mode option normal
source: Normal
pl: Normalna

# magic_mesh_surface_mode option surface
source: Surface
pl: Powierzchnia

# magic_spiralize description
source: Spiralize smooths out the Z move of the outer edge. This will create a steady Z increase over the whole print. This feature turns a solid model into a single walled print with a solid bottom. This feature should only be enabled when each layer only contains a single part.
pl: Spirala wygładza ruch Z na zewnętrznej krawędzi. Powoduje to stały wzrost Z w całym druku. Ta funkcja zamienia solidny model w pojedynczy, ścienny nadruk z solidnym dnem. Ta funkcja powinna być włączona tylko wtedy, gdy każda warstwa zawiera tylko jedną część.

# magic_spiralize label
source: Spiralize Outer Contour
pl: Zewnętrzne kontury po spirali

# material description
source: Material
pl: Materiał

# material label
source: Material
pl: Materiał

# material_bed_temp_prepend description
source: Whether to include build plate temperature commands at the start of the gcode. When the start_gcode already contains build plate temperature commands Cura frontend will automatically disable this setting.
pl: Możliwość wstawienia polecenia do temperatury płyty drukarskiej na początku kodu G. Jeśli start_gcode zawiera już polecenia dla temperatury płyty drukarskiej, program Cura wyłącza to ustawienie automatycznie.

# material_bed_temp_prepend label
source: Include build plate temperature
pl: Należy uwzględnić temperaturę stołu

# material_bed_temp_wait description
source: Whether to insert a command to wait until the build plate temperature is reached at the start.
pl: Czy wstawić komendę, poczekaj, aż temperatura stołu zostanie osiągnięta na początku.

# material_bed_temp_wait label
source: Wait for build plate heatup
pl: Oczekiwanie na ogrzanie stołu

# material_bed_temperature description
source: The temperature used for the heated build plate. If this is 0, the bed will not heat up for this print.
pl: Temperatura stosowana przy ogrzewanej płytce. Jeśli jest to 0, łóżko nie rozgrzeje się dla tego wydruku.

# material_bed_temperature label
source: Build Plate Temperature
pl: Konstruuj temperaturę stołu

# material_bed_temperature_layer_0 description
source: The temperature used for the heated build plate at the first layer.
pl: Temperatura stosowana przy ogrzewanym stole w pierwszej warstwie.

# material_bed_temperature_layer_0 label
source: Build Plate Temperature Initial Layer
pl: Temperatura stołu na pierwszej warstwie

# material_diameter description
source: Adjusts the diameter of the filament used. Match this value with the diameter of the used filament.
pl: Dostosowuje średnicę stosowanego filamentu. Dopasuj tę wartość do średnicy stosowanego filamentu.

# material_diameter label
source: Diameter
pl: Średnica

# material_extrusion_cool_down_speed description
source: The extra speed by which the nozzle cools while extruding. The same value is used to signify the heat up speed lost when heating up while extruding.
pl: Dodatkowa szybkość, w wyniku której dysze chłodzą się podczas wytłaczania. Ta sama wartość jest używana do oznaczania szybkości nagrzewania utraconej podczas nagrzewania podczas wytłaczania.

# material_extrusion_cool_down_speed label
source: Extrusion Cool Down Speed Modifier
pl: Regulatory prędkości do chłodzenia na wytłaczanie

# material_final_print_temperature description
source: The temperature to which to already start cooling down just before the end of printing.
pl: Temperatura, po której zaczyna się chłodzenie tuż przed końcem drukowania.

# material_final_print_temperature label
source: Final Printing Temperature
pl: Temperatura druku końcowego

# material_flow description
source: Flow compensation: the amount of material extruded is multiplied by this value.
pl: Kompensacja przepływu: ilość materiału wytłaczanego jest mnożona przez tę wartość.

# material_flow label
source: Flow
pl: Przepływ

# material_flow_dependent_temperature description
source: Change the temperature for each layer automatically with the average flow speed of that layer.
pl: Zmienić temperaturę każdej warstwy automatycznie przy średniej prędkości przepływu tej warstwy.

# material_flow_dependent_temperature label
source: Auto Temperature
pl: Auto Temperatura

# material_flow_temp_graph description
source: Data linking material flow (in mm3 per second) to temperature (degrees Celsius).
pl: Dane łączące przepływ materiału (w mm3 na sekundę) do temperatury (stopni Celsjusza).

# material_flow_temp_graph label
source: Flow Temperature Graph
pl: Wykres temperatury przepływu

# material_guid description
source: GUID of the material. This is set automatically.
pl: GUID materiału. To jest ustawiana automatycznie.

# material_guid label
source: Material GUID
pl: Materiał-GUID

# material_initial_print_temperature description
source: The minimal temperature while heating up to the Printing Temperature at which printing can already start.
pl: Minimalna temperatura podczas podgrzewania do temperatury drukowania, przy której można rozpocząć drukowanie.

# material_initial_print_temperature label
source: Initial Printing Temperature
pl: Początkowa temperatura druku

# material_print_temp_prepend description
source: Whether to include nozzle temperature commands at the start of the gcode. When the start_gcode already contains nozzle temperature commands Cura frontend will automatically disable this setting.
pl: Możliwość wstawienia polecenia do temperatury dyszy na początku kodu G. Jeżeli start_gcode już zawiera polecenia do temperatury dyszy, program Cura wyłączenie tego ustawienia automatyczne.

# material_print_temp_prepend label
source: Include material temperatures
pl: Uwzględnij temperaturę materiału

# material_print_temp_wait description
source: Whether to wait until the nozzle temperature is reached at the start.
pl: Poczekaj, aż temperatura dyszy zostanie osiągnięta na początku.

# material_print_temp_wait label
source: Wait for nozzle heatup
pl: Oczekiwanie na ogrzanie dyszy

# material_print_temperature description
source: The temperature used for printing.
pl: Temperatura stosowana do drukowania.

# material_print_temperature label
source: Printing Temperature
pl: Temperatura druku

# material_print_temperature_layer_0 description
source: The temperature used for printing the first layer. Set at 0 to disable special handling of the initial layer.
pl: Temperatura stosowana do drukowania pierwszej warstwy. Ustaw wartość 0, aby wyłączyć szczególną obsługę początkowej warstwy.

# material_print_temperature_layer_0 label
source: Printing Temperature Initial Layer
pl: Temperatura początkowej warstwy

# material_standby_temperature description
source: The temperature of the nozzle when another nozzle is currently used for printing.
pl: Temperatura dyszy, gdy inne dysze są obecnie używane do drukowania.

# material_standby_temperature label
source: Standby Temperature
pl: Temperatura w trybie czuwania

# max_feedrate_z_override description
source: The maximum speed with which the build plate is moved. Setting this to zero causes the print to use the firmware defaults for the maximum z speed.
pl: Maksymalna prędkość przesuwu płyty nośnej. Ustawienie na zero powoduje, że druk używa domyślnych ustawień oprogramowania dla maksymalnej prędkości z.

# max_feedrate_z_override label
source: Maximum Z Speed
pl: Prędkość maksymalna Z

# max_skin_angle_for_expansion description
source: Top and/or bottom surfaces of your object with an angle larger than this setting, won't have their top/bottom skin expanded. This avoids expanding the narrow skin areas that are created when the model surface has a near vertical slope. An angle of 0° is horizontal, while an angle of 90° is vertical.
pl: Górne i / lub dolne powierzchnie przedmiotu o kącie większym niż to ustawienie nie będą miały rozszerzonego górnego / dolnego rozdarcia. Pozwala to uniknąć powiększania wąskich obszarów ścian, które powstają, gdy powierzchnia modelu ma w pobliżu pionowe nachylenie. Kąt 0 ° jest poziomy, a kąt 90 ° jest pionowy.

# max_skin_angle_for_expansion label
source: Maximum Skin Angle for Expansion
pl: Maksymalny kąt rozciągania ścian

# mesh_position_x description
source: Offset applied to the object in the x direction.
pl: Przesunięcie wykorzystywane do obiektu w kierunku X

# mesh_position_x label
source: Mesh position x
pl: Pozycja siatki X

# mesh_position_y description
source: Offset applied to the object in the y direction.
pl: Przesunięcie wykorzystywane do obiektu w kierunku Y.

# mesh_position_y label
source: Mesh position y
pl: Pozycja siatki Y

# mesh_position_z description
source: Offset applied to the object in the z direction. With this you can perform what was used to be called 'Object Sink'.
pl: Przesunięcie wykorzystywane do obiektu w kierunku Z.. Aby wykonać procedurę zastosowano „niższy obiekt” w znaczeniu.

# mesh_position_z label
source: Mesh position z
pl: Pozycja siatki Z

# mesh_rotation_matrix description
source: Transformation matrix to be applied to the model when loading it from file.
pl: Matryca transformacji, która ma być zastosowana do modelu podczas ładowania z pliku.

# mesh_rotation_matrix label
source: Mesh Rotation Matrix
pl: Matryca rotacji siatki

# meshfix description
source: category_fixes
pl: Poprawki kategorii

# meshfix label
source: Mesh Fixes
pl: Poprawki siatki

# meshfix_extensive_stitching description
source: Extensive stitching tries to stitch up open holes in the mesh by closing the hole with touching polygons. This option can introduce a lot of processing time.
pl: Szerokie szwy próbują zszywać otwarte otwory w siatce przez zamknięcie otworu dotykiem wielokątów. Ta opcja może znacznie wydłużyć czas przetwarzania.

# meshfix_extensive_stitching label
source: Extensive Stitching
pl: Szerokie szwy

# meshfix_keep_open_polygons description
source: Normally Cura tries to stitch up small holes in the mesh and remove parts of a layer with big holes. Enabling this option keeps those parts which cannot be stitched. This option should be used as a last resort option when everything else fails to produce proper GCode.
pl: Zwykle Cura próbuje zszywać małe dziury w siatce i usunąć części warstwy z dużymi otworami. Włączenie tej opcji powoduje zatrzymanie tych części, których nie można zszywać. Ta opcja powinna być używana jako ostatnia opcja, gdy wszystko inne nie dostarczy właściwej GCode.

# meshfix_keep_open_polygons label
source: Keep Disconnected Faces
pl: Zachowaj rozłączone twarze

# meshfix_union_all description
source: Ignore the internal geometry arising from overlapping volumes within a mesh and print the volumes as one. This may cause unintended internal cavities to disappear.
pl: Zignoruj geometrię wewnętrzną wynikającą z nakładania się objętości w siatce i wydrukuj ją jako jedną. Może to spowodować zniknięcie niezamierzonych wewnętrznych ubytków.

# meshfix_union_all label
source: Union Overlapping Volumes
pl: Zwielokrotniające się tomy

# meshfix_union_all_remove_holes description
source: Remove the holes in each layer and keep only the outside shape. This will ignore any invisible internal geometry. However, it also ignores layer holes which can be viewed from above or below.
pl: Usuń otwory w każdej warstwie i zachowuj tylko zewnętrzny kształt. Zignoruje to niewidoczną wewnętrzną geometrię. Ignoruje jednak otwory warstw, które można oglądać z góry lub do dołu.

# meshfix_union_all_remove_holes label
source: Remove All Holes
pl: Usuń wszystkie otwory

# min_infill_area description
source: Don't generate areas of infill smaller than this (use skin instead).
pl: Nie wytwarzaj obszarów wypełnienia mniejszych niż ten (Zamiast tego używać skóry).

# min_infill_area label
source: Minimum Infill Area
pl: Minimalny obszar wypełnienia

# min_skin_width_for_expansion description
source: Skin areas narrower than this are not expanded. This avoids expanding the narrow skin areas that are created when the model surface has a slope close to the vertical.
pl: Obszary ściany, które są węższe niż minimalna szerokość nie zostanie poszerzona. W ten sposób unika że obcisłe zewnętrzne obszary ścian są rozszerzone, wynik, gdy powierzchnia modelu mającą niemal pionowe nachylenie.

# min_skin_width_for_expansion label
source: Minimum Skin Width for Expansion
pl: Minimalna szerokość zewnętrzna warstwa ekspansji

# mold_angle description
source: The angle of overhang of the outer walls created for the mold. 0° will make the outer shell of the mold vertical, while 90° will make the outside of the model follow the contour of the model.
pl: Kąt zwisania ścian zewnętrznych utworzonych dla formy. 0 ° spowoduje, że powłoka zewnętrzna formy będzie pionowa, a 90 ° sprawi, że na zewnątrz modelu znajdzie się kontur modelu.

# mold_angle label
source: Mold Angle
pl: Kąt formy
